[
    {
        "Author": "Sameena Ijaz",
        "Body": "Do not support a pedophile brand!! They are disgusting and they have abused children! Please do not be silent on this subject this company is a pedophile company please leave reviews everywhere on their yelp and on their websites do not stop!!",
        "Date": "2022-11-29",
        "Heading": "Do not support a pedophile brand!",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Louise",
        "Body": "Love love love\nQuick delivery and lovely products \nA bit pricey but worth the money",
        "Date": "2021-12-03",
        "Heading": "Love love love",
        "Location": "GB",
        "Rating": 5
    },
    {
        "Author": "ELLEN Driesen",
        "Body": "I buy very often Balenciaga clothes since they are beautiful and unique. I am however very unsatisfied about the lack of response or service I receive now that my handbag strap broke after only 1,5 years, The local shop can not help and refers me to the customer service. Customer service just does not react on the 2 emails I have send. I would dare to say this is extremely poor for a brand that sells his products at such a high price. I will think twice next time I want to buy something. I am especially very disappointed on how they treat customers, next to the fact that the product just does not have the quality I thought it would have based on the price they ask.",
        "Date": "2018-01-20",
        "Heading": "I buy very often Balenciaga clothes …",
        "Location": "CH",
        "Rating": 1
    },
    {
        "Author": "aj coleman",
        "Body": "Yall murder Isiah and stole his clothing design because he reached out and said he was gonna sue yall then yall say yall wanna hire him if he comes to florida store and he goes missing and never heard of again even friends and family yall murdered him and i hope the FBI get yall for it.",
        "Date": "2023-04-20",
        "Heading": "Yall murder Isiah and stole his…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Angela",
        "Body": "Disgusting Ad, eewwww Sick &  disgusting Ad. They are  children this company is wrong for putting that Ad out. I hope no one will ever buy your brand again!!! \nNever ever will I....",
        "Date": "2022-11-25",
        "Heading": "Disgusting Ad",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "TrustPilot user",
        "Body": "Satanic clothing company. Don't believe me, look at their Christmas 2022 campaign with hidden symbols, hints of child abuse, satanic name on red tape in the background. Even satanic books and court case on child pornography proudly stands in their marketing material for Christmas, with children in the photo. It's all in hidden sight, and they laugh at unsuspecting clients/victims. They even apologized and deleted some of their marketing photos in December 2022 after public reaction. Disgusting. Do yourself a favour, don't buy anything from satanic clothing company.",
        "Date": "2022-12-28",
        "Heading": "Satanic clothing company",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Ovidiu Tărbuc",
        "Body": "I ordered a pair of shoes from Balenciaga for my partner and never received them. I contacted their customer service via WhatsApp and despite reaching out multiple times over a week, they made no real effort to resolve the issue. The communication was slow, unhelpful, and disappointing, especially considering the brand's reputation and the price of their products. I expected a much higher standard of service. Extremely disappointed and would not recommend buying directly from their website.",
        "Date": "2025-04-28",
        "Heading": "I ordered a pair of shoes from…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Majid Syed",
        "Body": "Allah est rex",
        "Date": "2023-07-26",
        "Heading": "Allah est rex",
        "Location": "IN",
        "Rating": 1
    },
    {
        "Author": "MartinEE",
        "Body": "TERRIBLE service and product quality!\n\nMy wife have a pair of Balenciaga \"Triple S\" shoes that cost EUR 695. \nThe shoes has 3 colors and after a walk when it began to rain, the colors was washes into eachother. It has not been possible to remove the colors - neither by professionels or Balenciaga themselves (they didnt even wanna try, which tells me they know how BAD quality their colors are).\n\nWe have been writing with Balenciaga many times and waited forever to finaly get this final answer from them:\n-------------\n\"Good afternoon, \n\nThank you for your patience while our technical office was analyzing your request. \n\nUnfortunately, our experts have explained it is not possible to repair the item and bring it back to its originel status. Also, as it is out of warranty, we are not in a position to arrange a return for refund, exchange nor credit note. \n\nTherefore, we won't be able to go further with your request.\n\nI hope you will understand Balenciaga's position. \n\nKind regards....\"\n---------------\n\nLOL - \"I hope you understand Balenciagas position\" my @ss. \nYes, I know your position, Balenciaga: You are CAPITALISTS who gives NO SERVICE whatsoever!\n\nWe have bought our LAST Balenciaga products - that is for sure! - and we WARN everyone else about doing byuing Balenciagas products! \n\nWASTE OF MONEY!",
        "Date": "2022-05-03",
        "Heading": "TERRIBLE service and product quality!",
        "Location": "DK",
        "Rating": 1
    },
    {
        "Author": "Tawana",
        "Body": "I purchased a pair of Speed 2.0 LT K. Recy, I wear a size 39 in which I ordered. After 1 wear I noticed they were tight and uncomfortable. However per Ethan at the corporate headquarters they run a half of size to a full size too small depending on the sneaker. The website does not reflect any such information. Ethen then decided I may not be correct so he confirmed my findings on their website. Now I am out of $1082 of my hard earned money because the website is not transparent. Don’t order online and read the reviews don’t make an expensive mistake. For an expensive sneaker the customer service is horrible no Empathy",
        "Date": "2022-08-13",
        "Heading": "I purchased a pair of Speed 2.0 LT K",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Troy Mason",
        "Body": "The worse. Purchased  a pair of triple s balenciagas that has a dye run defect that balenciaga refuses to address",
        "Date": "2019-03-01",
        "Heading": "The worse",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Karen Farnworth",
        "Body": "Bought some speed runner trainers from balenciaga paid 685 , worn a handful of times over a 7 months period and they have all come away inside and cut all my feet , I have been rejected from balenciaga they said it’s my fault the trainers are like new outside but they won’t take responsibility for a faulty pair of trainers , will never order or buy from this company ever again absolutely disgusting",
        "Date": "2023-02-08",
        "Heading": "Bought some speed runner trainers from…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "DJ",
        "Body": "Beware of the phantom sneaker and the overall QC of the brand now. I spent $700.00 on one of the new sneaker models, phantom. ( the one trying to look like brooks lol ). The soles are cracking in the same area on both sneakers. This is Clearly a defect because the shoes have no other wear and  tear and have been worn off and on for only 3 weeks. Have not gotten wet. Have not been washed. Have not been worn running.",
        "Date": "2022-06-03",
        "Heading": "Beware of the phantom sneaker and the…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Nadya Parveen",
        "Body": "Worst company to buy from, customer service is atrocious. Customer service doesn’t exist. They right and your wrong. They were defensive and speak to you like s**t, this fileep Philip guy is an arrogant being, who needs sacking, he can’t take criticism and throws his dummy out but thinks it’s ok to speak to others in the exact same way. Wouldn’t surprise me if he had a good cry because he didn’t get his way :D",
        "Date": "2019-08-08",
        "Heading": "Customer service non existing",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Przemyslaw Grudzien",
        "Body": "You're going down mother fuc**** campaign with childrens was way too far",
        "Date": "2022-12-18",
        "Heading": "You're going down mother fuc****…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Kwan Ken",
        "Body": "Balenciaga Store does not care about its customer experience!\n\nI purchased a pair of Triple S shoes from the past season (fall/winter 2018 collection) on 16 June 2019 in Singapore at the Balenciaga Store Paragon Orchard. I bought those shoes because the Sales Rep told that there is a 30% discount on this pair past season shoes.\n\nThe Sales Rep informed me that the retail price is at $1330 SGD; so I paid 931SGD after the 30% discount. When I got home, I realised that the receipt that I received just stated $931 SGD without specifying the original price of $1330SGD and discount. Also, the price tag on the shoe box itself stated the retail price to be $931SGD. It really seems odd. It seems as if not discount is given at all. All evidences point to the fact that the shoes were just retailing at $931 and I just paid FULL price. Seriously, I felt confused and cheated. I immediately went online to find out more. \n\nI realised that past season Triple S is priced at 560pounds which is about $962SGD at Mr Porter; and Mr Porter is having a 30% discount just like the Balenciaga Store. This works out to be $674SGD.\n\nI hope that Balenciaga can look into this. I was not expecting this to happen. It will be such an awful experience to feel that Balenciaga marks up the price of its past season shoes and misleads its customers into thinking that they are getting a 30% discount. The fact is that the customer is paying for exactly what its original price is at about $960.",
        "Date": "2019-06-29",
        "Heading": "Balenciaga Store does not care about…",
        "Location": "TH",
        "Rating": 1
    },
    {
        "Author": "Screaming Eagle",
        "Body": "Balenciaga knew very well they were sexualizing children to sell their product. Anyone who supports this brand supports the rape and sexual abuse of children. Balenciaga blames others in their ad but they themselves are also to blame.",
        "Date": "2022-12-02",
        "Heading": "Balenciaga supports child rape and sexualization.",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Emanuel  Nitu",
        "Body": "A horrible brand",
        "Date": "2022-11-29",
        "Heading": "A horrible brand",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "LewyKrvl “Lewy”",
        "Body": "I returned the package to them according to their instructions which were in the box along with the shoes I ordered. It has been 4 weeks since I got my money back, the shoes arrived on the 7th of January. Support doesn't give a s*** about me and only once they wrote me back that my shoes weren't in the package even though I sent everything according to the procedure because I wanted to get my money back that I paid for the shoes because I needed them and the shoes were gone...\nNow I have neither the shoes nor the money, they don't give a s*** about me, they don't respect the customer, they can't even reply to an e-mail or explain the matter taking care of their customer, they don't give a s*** about anything. I advise against buying from them, it is better to buy products from other manufacturers who care about customers and their customer service is as it should be, not as it is at balenciaga.com. They have no respect for the buyer's money, for them the customer as an individual is nothing, because they know that someone will buy their products anyway, so for them 1000 euros is not a loss, but for the customer who had to earn it hard is a gigantic loss... If someone from customer service reads this, start working, because after 5 emails you still have not done anything, the last email you sent me was a week ago.",
        "Date": "2021-02-03",
        "Heading": "Scammers",
        "Location": "PL",
        "Rating": 1
    },
    {
        "Author": "Jeffrey Pauletich",
        "Body": "Evil company and should be investigated for child exploitation and endangerment.",
        "Date": "2022-11-30",
        "Heading": "Evil company and should be investigated…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Christine Lee",
        "Body": "I have purchased a few pairs of Balenciaga trainers and have always found the quality excellent.  On the last occasion unfortunately there was a small fault.  Once reported and after a few emails back and forth I found customer services to be exemplary, super efficient and very helpful.  I would not hesitate to purchase again.",
        "Date": "2022-02-19",
        "Heading": "Great service",
        "Location": "GB",
        "Rating": 5
    },
    {
        "Author": "Anne",
        "Body": "Bought a pair of balenciagga .. don’t we’re them that often..and they have started to rip been in contact with them but are not interested…also they are still under guarantee…for the price you pay for them they still have no interest..so balenciagga shocking customer service…",
        "Date": "2022-08-30",
        "Heading": "Bought a pair of balenciagga .",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Disappointed",
        "Body": "After buying a knitted jumper in June 2019 black with white wording\nI hand washed it for the first time as soon as I put it in cold water the black dye started bleeding out which has turned the white wording grey \nI contacted Balenciaga and there customer care department told me the condition of the jumper was down to wear and usage ,\nAs I live in a hot country this jumper was only worn a few times before washing \nI am still waiting for them to come back with an answer as to why the dye has run ,what are there technical team doing when they wash test there products before production ?\nObviously Nothing \nThey take No responsibility for there products and don’t give solutions to customers",
        "Date": "2020-01-25",
        "Heading": "After buying a knitted jumper in June…",
        "Location": "LK",
        "Rating": 1
    },
    {
        "Author": "Jessica",
        "Body": "I bought the Balenciaga triple S and after a few months I needed to return them back because the quality was very poor. The customer service helped me and gave me a refund. It took a little bit of time but I am glad they did it without any hesitation after they saw that they couldn't fix the shoes. They also didnt't ignore me or anything. All in all - great and friendly customer service :)",
        "Date": "2019-09-03",
        "Heading": "Great Customer service",
        "Location": "DE",
        "Rating": 5
    },
    {
        "Author": "Marie",
        "Body": "Pedophiles. Hope they will investigate on you and you get what you deserve evil monster. Burn in hell you and your compagny.",
        "Date": "2022-11-28",
        "Heading": "Pedophiles",
        "Location": "CA",
        "Rating": 1
    },
    {
        "Author": "Robert Hanna",
        "Body": "Absolutely demonic and evil company! Which company portrays children in sexual manner? This company 👿👹🤬",
        "Date": "2022-12-02",
        "Heading": "Absolutely demonic and evil company",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Ami",
        "Body": "I have 2 colors of Track sneakers, 2 colors of Triple S sneakers, Speedrunners 3.0, Runners and Speed1.0 and 7 bags from this brand. The first shoes out of 7 pairs I bought 8 months ago. Both Tracks (one is 2 months old the other one is 6 months old) have holes inside and the speed 3.0 is cracked in the sole after 3 months. They gave me the chance to get another pairs of shoes so I did that in place of my defected speedrunners 3.0. I love the design but quality is really really normal and not high end. Also my B chain bracelet changed in color after 1 month of having it (550 euro's). Very very very disappointing and disturbing. \nNike and Adidas shoes last at least a year. these 4 Balenciaga items not even a season.",
        "Date": "2022-09-14",
        "Heading": "I have 14 Balenciaga shoes & bags and ...",
        "Location": "NL",
        "Rating": 1
    },
    {
        "Author": "Meilan Matabadal",
        "Body": "I puchased a cream Balenciaga hoodie and much to my disappointment, it sheds excessivesly on the inner of the garment. I have attempted wash it and use a lindt remover but the issue still persists. I've been told by the store that it's part of the winter collection so it's normal... not sure how that makes any sense. Really appauling for such a preimum priced brand.",
        "Date": "2021-12-13",
        "Heading": "Excessive Lindt from Hoodie",
        "Location": "SG",
        "Rating": 1
    },
    {
        "Author": "Kelly Lou",
        "Body": "Pedo company stay away do not support these monsters",
        "Date": "2022-12-28",
        "Heading": "Pedo company stay away do not support…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Freddie Phillips",
        "Body": "very good experience, clothes got many women attracted to me!!!!!!!!!!!!!!!!!!",
        "Date": "2025-01-20",
        "Heading": "very good experience",
        "Location": "GB",
        "Rating": 5
    },
    {
        "Author": "Fiona Jayne Read",
        "Body": "Ordered shoes for daughters 18th online money taken from account. Shoes didn’t arrive on time so order chased some garbish about my bank card even though they had taken cash but would not be sending shoes orderd- money would be refunded in 7 days. Shocking service and don’t believe story about card as they did exactly the same to a friend a few months. Quick to take the money but not to deliver. I think they are a corrupt company who think they can do what they want.",
        "Date": "2020-09-19",
        "Heading": "Terrible Company",
        "Location": "GB",
        "Rating": 2
    },
    {
        "Author": "Simone",
        "Body": "Waste of money! \nSpent £595 on Balenciaga speed‘s after wearing them 10 times maximum they have started to fray! After informing them i was told to take it up with the retail i bought them from! I was then told that it is up to Balenciaga to sort! \nThey have said i must have walked in them outside? Or put them in the washing machine! So i questioned are these shoes not to be worn outside? And why would i put them in the washing machine if they are in good condition apart from the fraying, i even offered to send them so they can kindly smell the inside of the shoes to see if they have been washed! \nSadly for myself iv wasted my hard earned money on these (should of stuck to gucci or mcqueens atleast they take there customers more seriously) \nThe part of my now none useable shoes that are fraying is the inside of the foot so i guess i must walk with broken ankles. Wont waste anymore money of this brand as they dont care for there customers unless they are wealthy!  \nOh and before anyone says anything no i wasnt informed this could happen! I was only informed the sign on the outside of the shoes could come off if stood on! Which is in perfect Condition.",
        "Date": "2022-08-07",
        "Heading": "Waste of money",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Waqas Khan",
        "Body": "You sick devils you probably pay your way out like you have for many years selling junk I hope the stocks drop I hope your company burns you sick French long Nose humps you shouldn’t be getting away with this justice should be served",
        "Date": "2022-12-09",
        "Heading": "You sick devils you probably pay your…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "emete Vural",
        "Body": "i accidently bought the wrong size speed trainers for £650 sent them back next day for the right size then was informed they could not change them because they where fake,im very outraged im a 54 year old woman that made mistake on size and now being told i sent them fake ones back.if they are fake its because they where sent to me by balenciaga .im stuck with wrong size sneeker that was branded fake by them and out of pocket of £650 pounds .they did the same to a rapper in america and when realized he was famous they changed the shoes and said it was made in one of there cheaper factories abroad .may god dam you to hell you evil lying scum",
        "Date": "2025-03-11",
        "Heading": "i accidently bought the wrong size…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Ming Yass",
        "Body": "Balenciaga promotes child pornography.",
        "Date": "2022-11-22",
        "Heading": "Balenciaga promotes child pornography.",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "colin brydon",
        "Body": "Not sure where to start with this review. My son\n has just got his 2nd pair of balenciaga trainers.\n\nThe first pair were ‘triple s’without the air bubbles and within a few weeks the stitching at the side of the ankle had come away. Took them back to Harvey Nichols for a replacement, but unfortunately they didnt have the colour in stock. So got repaired and within a few months same again. The sales person at HN did say due to hand stitching this can and does happen. So stuck with a faulty pair. Great looking trainers but unfortunately not robust enough to last any time. £700 waste off money.\n\nBought a pair of sock boots (speed 2.0) on the 31st dec 21 COSTING NEARLY £700 a few days ago. My son has worn them twice. Once walking around for a few hours the other a walk to the car. These ones have individual rubber lettering to the top. Now two off the letters are hanging off. So back to flannels for a refund. \n\nWhat I will say with the hoodies they are good quality and have lasted really well.\n\n\nWE WILL NOT BUY ANY MORE BALENCIAGA TRAINERS. A COMPLETE WASTE OF MONEY.",
        "Date": "2022-01-04",
        "Heading": "2 pairs of trainers both faulty. DONT WASTE YOUR MONEY.",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "V Leng",
        "Body": "This brand should really a ashamed about their customer service! I have ordered and paid a pair of shoes as a christmas gift, for my daughter, on Dec 5th. My order was lost during shipment... No only, I never received the package for christmas but 3 weeks after I still have not received a refund!\n\nCette marque devrait vraiment avoir honte de son service client! J'ai commandé et payé une paire de chaussures comme cadeau de Noël pour ma fille le 5 décembre. Ma commande a été perdue lors de l'expédition ... Non seulement, je n'ai jamais reçu le colis pour Noël mais 3 semaines après je n'ai toujours pas reçu de remboursement!",
        "Date": "2019-12-30",
        "Heading": "Big shame on their customer service!",
        "Location": "FR",
        "Rating": 1
    },
    {
        "Author": "EG",
        "Body": "Bought a pair of speed trainers, after wearing them for 15mins the right side of the shoe caused consistent pressure against my achilies heel. After taking a closer look there was a misalignment in the stitching at the back.\nI took them to the Collins St store in June the sales asistant said we have to send them to the headoffice to assessment and should receive a response by friday.. one week turned into 3 months. during that time I made phone calls back to the store they said they still haven't heard anything from the headoffice and they are experiencing staff shortage hence the delay. \nReceived a SMS not 'phone call' in September from the Store saying they got a response from HQ concluding they I have not idenitfied any irregualrities with the shoes. It was assessed and in her words \"rejected\" in the final stage of asessment. My only option was accept the shoes back wasn't entitled to a refund, exchange or credit for the time I waited. The Staff at this particular store were not transaparent with me from the start as to how long it'll take and didn't say they were going to be shipped off as she took photos of the shoes and said we'll send these as evidence. When they finally confirmed that they were going to sent the shoes back today after 2 weeks of not replying as the girl apparently was on annual leave; and rehashed the same thing the other girl said about the HQ assessment. Today they sent the shoes back. \nWill not buy from this brand ever again after spending $1,175 on these shoes not even offered a exchanged for the waiting game with these people, disgusting.",
        "Date": "2022-09-30",
        "Heading": "Dud pair of speed trainers",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Quentin Oakley",
        "Body": "Do not support this sick and disgustingly vile company they have shown support for paedophilia.  Then act like they didn't know what they were doing, as if the public are as stupid as they are. They should be ashamed and I hope that all involved go down the toilet where they belong.",
        "Date": "2022-12-07",
        "Heading": "Paedophile Supporters",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Roxana Mobasheri",
        "Body": "Amazing service. There was a manufacturing fault on my Balenciaga speed trainers (logo was peeling off after only 4 weeks) so I took them back to the Mount Street store in Mayfair with the original receipt and box to discuss the problem. There was no fuss and they did not doubt my concerns and swiftly got me to fill out a form with the details. I left the shoes behind in their premises and was advised me it could take up to 8 weeks for them to run some checks with the manufacturer back in Italy but assured me they would be in contact. Several weeks later, (before the time I expected) I received an email from the Mount Street store manager to come in and pick up a replacement pair in my size that had been reserved for me. I am always greeted in a warm and friendly manner by the sales team and I was satisfied with the customer care that I received. The manager went above and beyond to ensure the problem was dealt with in a professional manner. Thank you for the impeccable service.",
        "Date": "2021-03-30",
        "Heading": "Amazing service",
        "Location": "GB",
        "Rating": 5
    },
    {
        "Author": "Kali Roman ",
        "Body": "What's done in the dark will come out in the light. Please don't buy from these pedos protect our children from adult entertainment and creeps that prey on the innocent.",
        "Date": "2023-03-15",
        "Heading": "What's done in the dark will come out…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Наталия Шадура",
        "Body": "Very shocked how this Company work.I bought the shoe and they pack me different shoe in box. I apply for customer service in official site and Laurene from client service advise me to go shop and issue my problem… they don’t care about clients at all.\nI also want advice you Ms Laurene just find other job if you don’t have skills to work with customer service.",
        "Date": "2022-12-11",
        "Heading": "No customer services at all ,Balenciaga don’t have quality of Servise",
        "Location": "AE",
        "Rating": 1
    },
    {
        "Author": "Lindsay  Greene",
        "Body": "Quite honestly the worst customer service experience ever. Luxury in price only. They don’t back up their product. I had a purse repair approved by them. Was told it would take 4-6 weeks. They made me ship them the whole bag even though it just needed the strap replaced. 15 weeks later I still don’t have my bag back, no one will call me back or email me. They don’t even respond to the Better Business Bureau. I have asked them to at this point just issue a replacement if they can’t commit to a repair completion date and no one there is taking any ownership nor do they have any power or desire to creatively problem solve to resolve the issue. So basically at this point they’ve just stolen this $2500 bag from me.",
        "Date": "2022-07-25",
        "Heading": "Quite honestly the worst customer…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Avani Kaur",
        "Body": "NEVER EVER BUY FROM THE STORE. I was served by Sihem in the London flagship store before lockdown. The most unhelpful, curt and arrogant staff I have ever come across. Always buy your goods from Selfridges and Harrods they will let you return their goods. The Balenciaga staff never told me I couldn’t return my goods if I had an issue (it’s not very hard to speak up and say this to customers by the way it just requires simple communication skills which you should have learnt at school). I went to return my brand new unworn triple s sneakers the day after I bought them because they were too heavy and they said no. Bit late after I spent £700 on them. Trust me I buy luxury goods often but ALWAYS use department stores such as Selfridges as they accept returns and treat you nicely as everyone should be. Spending money doesn’t ever  mean guaranteed quality. But this awful situation worked out for me as I sold them for £1000 on StockX so a blessing in disguise after dealing with such awful staff. Why they treat people like this I will never understand. What on earth have customers ever said to you for you to be so arrogant and stuck up, it’s actually humorous to see people behave in this manner as adults.\nChildren know better. I’m not even writing this review as an annoyed customer who didn’t get a refund (which I didn’t) I resold mine but I’m writing this to tell you all don’t just ignore my review, trust me Gucci, Dior etc treat customers much better. Balenciaga staff are awful to deal with and clearly don’t remember you should treat people with respect if you want to be treated likewise. If you don’t want to be in a horrific situation, listen to me and use department stores.",
        "Date": "2021-02-26",
        "Heading": "NEVER EVER BUY FROM THE STORE",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Gail Mei Mei",
        "Body": "I pre-ordered a pair of black logo speed trainers from Luisaviaroma in December 2017 which Balenciaga promised to have it delivered by mid Feb 2018. \n\nBut till now (14 March'18) the pre-order has not been fulfilled.  I'm not sure how long this is going to take. \n\nIt's totally not Lujsiviaroma fault I suppose the only fault is that they should not accept payment first. I've been in constant communication with Luisaviaroma on the delivery date but according to them Balenciaga has not replied them on a confirmed delivery date at all.  \n\nLuisaviaroma customer service is superb. They replied my email on time and they would accept my cancellation on the pre-order. But I love the shoes so much that I'm willing to wait a bit more... \n\nMy point is if Balenciaga could not fulfil then don't promise and don't sell. \n\nI saw Barneys and  Saks also doing pre-orders during December 2017 too. I'm just wondering whether they have been fulfilled? ???\n\nThis is so disappointing. Such a great company , great products but the  customer service and management is low class.",
        "Date": "2018-03-14",
        "Heading": "I pre-ordered a pair of black logo…",
        "Location": "SG",
        "Rating": 1
    },
    {
        "Author": "Nick",
        "Body": "Overpriced average clothing. Save your money.",
        "Date": "2018-09-09",
        "Heading": "Overpriced average clothing",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Jordan Scott",
        "Body": "So I bought the adidas triple s white/black/grey first run shoe and it was a great purchase, right down to the journey they took through Italy as shown on tracking, and the opening of the package with its blue balenciaga shopping bag thrown in but the overall shoe quality felt decent. The posh receipt and the booklet and a shoe bag, it felt special. Now I bought two pairs from adidas. Triple s red/white and the blue/white and what a letdown. Quality wasn’t great. No paperwork. No balenciaga tag on shoe, just twine and a cheap adidas barcode tag. No shopping bag and the crate paper inside the box looked like children had opened crumpled and put back in and the tracking wasn’t as exciting…northwest of England lol . So did I just buy two expensive pairs of adidas which they added an extra £50 because they’re definitely not balenciaga",
        "Date": "2022-11-18",
        "Heading": "Balenciaga or adidas..which did I get",
        "Location": "GB",
        "Rating": 3
    },
    {
        "Author": "Anushka Kandola",
        "Body": "I was having trouble getting my defective Balenciaga bag repaired through Netaporter (I originally purchased the bag through them) and Emmanuel from Balenciaga's customer service team helped me to make it happen. He went above and beyond to chase down the right people for me and he was super responsive throughout the whole process. Tip top customer service that I've not experienced anywhere else! ",
        "Date": "2024-12-10",
        "Heading": "Emmanuel is a star! ",
        "Location": "GB",
        "Rating": 5
    },
    {
        "Author": "Louis Warrick",
        "Body": "What kind of pretentious w*nkers would pay 95 quid for a pair of socks? Who do these people think they are selling a pair of socks at this price when it probably costs a few pence to make in some factory in vietnam, robbing b*stards",
        "Date": "2021-07-17",
        "Heading": "Scambags",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Maz",
        "Body": "I purchased balenciaga speeds few months back and the quality has become so poor already, I am very disappointed considering i have spent a lot of money on these",
        "Date": "2020-10-14",
        "Heading": "The quality of the shoe has become so poor so soon!",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Laima Gaile",
        "Body": "This company support child pedophilia and openly shows the world it.",
        "Date": "2022-11-28",
        "Heading": "This company support child pedophilia…",
        "Location": "IE",
        "Rating": 1
    },
    {
        "Author": "Guy Fawkes",
        "Body": "Paedophile company, I’d be wary of every celeb wearing their trash and anyone who works in their stores. Pizzagate was real and all these c**ts have been getting involved. Burn every store you see and if you are ever lucky enough to bump into once of the CEOs I’ll pay a hefty price for their pelts",
        "Date": "2022-12-01",
        "Heading": "They support the rape and murder of children",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "æ",
        "Body": "DISGUSTING. aside from all the horrible things they support. their merchandise is ugly and cheaply made. very disappointing as usual.",
        "Date": "2022-12-07",
        "Heading": "DISGUSTING",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "damntwin Whereyabeen",
        "Body": "YOU CHILD MOLESTERS",
        "Date": "2022-11-30",
        "Heading": "YOU CHILD MOLESTERS",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "anonym",
        "Body": "I am extremely disappointed that Balenciaga continues to work with UPS, a company that has proven to be completely incompetent. For three days, my urgent order has not been delivered, and now even further delays have occurred.\n\nToday, when the courier finally arrived, he refused to accept cash payment because the card machine didn’t work. Despite my urgency, he simply walked away without delivering my package.\n\nI contacted customer service three times, and two agents assured me that my package would arrive today. However, a third agent suddenly claimed nothing could be done and even refused to connect me with a supervisor or provide a complaint email. She then hung up on me.\n\nI find it outrageous that Balenciaga entrusts its deliveries to a company that operates in such an unprofessional manner. I have lost all trust in ordering from you because UPS is damaging your brand’s reputation. If a luxury brand cannot guarantee a reliable shipping service, what’s the point of selling \"exclusive\" products?\n\nThis experience has convinced me to never order from Balenciaga again. You can keep your products—I will take my business elsewhere. I strongly urge you to reconsider your partnership with UPS before more customers are lost due to their incompetence and lack of accountability.",
        "Date": "2025-03-14",
        "Heading": "I am extremely disappointed that…",
        "Location": "CH",
        "Rating": 1
    },
    {
        "Author": "Ali",
        "Body": "Ran by pedophiles",
        "Date": "2022-11-29",
        "Heading": "Ran by pedophiles",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "HappyMom",
        "Body": "I wouldn’t buy s**t from this evil company. Apparently they are all pedophiles here! GROSS!!! EVIL!!! Why aren’t they shut down yet?!?!? Unbelievable! F*** Off you sick f****!!",
        "Date": "2022-11-27",
        "Heading": "I wouldn’t buy s**t from this evil…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Leah Mills",
        "Body": "The depiction of Africa and African American women is despicable. The Bucking bulging Eyes in the high end photo's are so disgusting. This company like many have no respect and exploit the black race by making fun of something that is considered KOONISH  to the white race but we SEE YOU. YOUR THE REAL KOON.",
        "Date": "2022-08-24",
        "Heading": "The depiction of Africa and African…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Stefan",
        "Body": "Bought off this brand. Finally seen the REPEATED references to pedophilia going back years. Disgusting",
        "Date": "2022-11-29",
        "Heading": "So disappointed",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Tamika Back",
        "Body": "Theives their art from young Indigenous artists, no apologies has been made to Tra My Nguyen for their outright plagerism of her deeply personal art piece.",
        "Date": "2020-07-26",
        "Heading": "Theives their art from young Indigenous…",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "JL",
        "Body": "For everyone saying this is overpriced, its cause u guys are too poor or broke to buy them. If u dont like them, dont buy them. Cause there are plenty rich people with money like me who buy their products while u guys can just go to old navy and buy cheap clothes",
        "Date": "2018-09-16",
        "Heading": "Fake reviews",
        "Location": "US",
        "Rating": 5
    },
    {
        "Author": "Alexandra Valcea",
        "Body": "I bought a pair of shoes. In one month the material was damages. Such a bad quality. Just go with other brands",
        "Date": "2023-10-18",
        "Heading": "I bought a pair of shoes",
        "Location": "NL",
        "Rating": 1
    },
    {
        "Author": "Vanessa",
        "Body": "I should have listened to the reviews! Don’t be like me!!! I had abit of hope thinking that somehow I wouldn’t have the same experience as the many people who gave balenciaga their bad review!! I was no different.\n\nShipping was meant to be 4-8 days it’s been 9 days and order is still ‘pending in warehouse’ I have called twice and both employees said that it would be shipped that day which was a complete lie. I attempted to cancel my order and supposedly it’s too late because it’s in transit to being shipped. Despite 0 tracking or shipping information available on their side. \n\nPlease don’t waste your time!!! So not worth it. Spent £565 on trainers and I can’t even receieve them in a timely fashion. I will not be buying from here again!!!",
        "Date": "2020-08-04",
        "Heading": "I should have listened to the reviews!!!!",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Trine Johannsen",
        "Body": "I returned a pair of boots 3,5 weeks ago, because they broke. Balenciaga told me to send them back to them, and it's been 3,5 since they received them and I haven't heard a thing. They are not responding when contacting them through e-mail. This is a joke",
        "Date": "2019-03-24",
        "Heading": "no customer service",
        "Location": "DK",
        "Rating": 1
    },
    {
        "Author": "Gilca Madi Sillos",
        "Body": "Worst custume service ever!!! I'm really disapointed i bought a expensive product that now is broken and the company doen't care abaout they ignore all my massages.",
        "Date": "2018-01-16",
        "Heading": "Worst custume service ever!!",
        "Location": "BR",
        "Rating": 1
    },
    {
        "Author": "Nataliya G.",
        "Body": "Awful customer experience with Balenciaga. On the 20th of April I placed an online order for the item I was subscribed that became available that day. The order went through and my card was charged accordingly. I also received an order registration mail. Today, on the 2nd of May, I decided to raise a status request as I had no other mails and notifications from Balenciaga. Balenciaga's response was a kind of 'oh, didn't you know the item is out of stock'? Sorry, how would I know that? Nobody even thought to notify me and propose to cancel my order. I also \"like\" their statement  that I actually did not pay the order, it was just pre-authorisation and it will be cancelled as soon as I canceled the order.... What? My card was charged, that's it. And what if I did not raise the request today? You keep my order indefinite time? Ridiculous and disrespectful! ",
        "Date": "2024-05-02",
        "Heading": "Awful customer experience! ",
        "Location": "SG",
        "Rating": 1
    },
    {
        "Author": "Emilie Livesey ",
        "Body": "BALENCIAGA WHAT A DISGRACE!!!!!!!!!! I bought some balenciaga triple s trainers in august 2020 the shoes inside have ripped where my heel is. bare in mind it has been lockdown most of the time and I haven't worn these shoes a lot. The shoes cost £650 I have reported this back to balenciaga for them to come back to me and say they are wear and tear. This is disgusting of them as the shoes look brand new so I don't understand. I have now had to get trading standards involved as the shoes aren't fit for purpose. I will NEVER EVER buy again off this company they have treated me so terrible and I am really upset about the situation. Im just going to leave this with trading standards now as I am so disappointed.",
        "Date": "2021-03-01",
        "Heading": "BALENCIAGA WHAT A DISGRACE!!!!!!!!!",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Melike",
        "Body": "I have contacted Balenciaga customer service in April. Finally, I got my shoes delivered to Balenciaga Paris in August. After 4 months, it was a success for me since dealing with Balenciaga customer service is a tedious job. Afterwards, I was expecting to get some information, so I try to talk to supervisor and he said he exchanged my shoes with new ones, and he send me a tracking number to see the details of the shipment. When i checked the tracking number, I saw that it is the number that I used when I was sending my shoes to Balenciaga Paris. So, right now, nobody is answering me, there is no information, I don't know my shoes' whereabouts. Soon, I will try to find a legal solution. I will never have anything to do with Balenciaga anymore. This is the worst place to shop if you want to decent customer service.\nP.S. All these things are happening in 2019.",
        "Date": "2019-10-02",
        "Heading": "Balenciaga?? Never again!!!",
        "Location": "TR",
        "Rating": 1
    },
    {
        "Author": "Eren Akar",
        "Body": "Do you not buy from this company",
        "Date": "2022-11-30",
        "Heading": "Do you not buy from this company",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Nicky Curry ",
        "Body": "I bought a set of speed 2.0 trainers for my girlfriend as a Christmas present from this company, they sent out a faulty pair of trainers, the right trainer has a bobble on the top of the toe section and you can see some sort of glue on the side of the sole. The customer service is terrible. Constantly lied to, I waited for a returns label for 3 weeks as every time I spoke to someone they said that they would email me the label but every time I never received it from them. Id never buy from these again. So disappointed, I will keep the faulty pair of £630 trainers as they can’t be trusted. Avoid this company at all cost",
        "Date": "2021-01-15",
        "Heading": "Sending out faulty goods",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Ron Locascio",
        "Body": "China junk,,,¡¡ 🇨🇳 Unfortunately I have to give it at least one star I give it a 0",
        "Date": "2022-12-18",
        "Heading": "Junk",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "David van Gessel",
        "Body": "Garbage people selling garbage",
        "Date": "2022-11-30",
        "Heading": "Garbage people selling garbage",
        "Location": "NZ",
        "Rating": 1
    },
    {
        "Author": "Amy from somerset",
        "Body": "Rude unhelpful customer service refusing refund or exchange for a Christmas gift. The gift was purchased on nov 24th. Too late for a refund by one day. \nPhone lines and live chat were not working after Christmas so no customer service available. \nVery disappointing customer service",
        "Date": "2023-01-05",
        "Heading": "Rude unhelpful customer service",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Natalie",
        "Body": "If I could give Balenciaga customer service zero stars, I would. I purchased a pair of Predator sneakers at Saks Fifth Avenue in late July. By late August, a portion of the label of the one shoe fell off per the photos attached. I contacted Balenciaga on September 7th. After sending customer service a dozen more photos that were asked for (for what reason, I don’t know), they finally said on October 19th that “if the repair will further compromise the item our repair center will not allow it.  The logo cannot be re-glued onto the shoe.” Well, two independent shoe repair services have told me that my issue is easily fixed, so it seems to me that Balenciaga simply is unwilling to stand behind their product and are perhaps more concerned about preserving their profit margins than behaving like a luxury brand. Very disappointing.",
        "Date": "2022-10-19",
        "Heading": "Truly Horrible Customer Service from Repair Team",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "An upset citizen",
        "Body": "This “brand” is absolutely disgusting! To the company, investors, and anyone who supports this crap, shame on you. How can this crap even be legal?! This company is full of disturbing people who need to either be locked away or treated for mental health issues. Sick fuqs! Sad thing is, they don’t care cause they’re making money off this crap. Sad world we live in. If I had any power, everyone supporting this sh!t would be locked the fuq up!",
        "Date": "2022-11-30",
        "Heading": "This “brand” is absolutely disgusting",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Tara Hastings",
        "Body": "Take responsibility for your actions!! I couldn't believe that a company in this day and age would actually promote the sexualization of children. To use castrated children (the elusion of castrated children) is absolutely the most disgusting thing, the sexualization of children what is wrong with you people? Did you think our society was so sick and depraved that those ads would fly? You shouldn't be given a chance to correct your actions, you were just testing to see if our world would accept your absolutely disgusting actions. Just a sick sick sick sick company. Throw away anything and everything that has to do with this company. They should be ashamed and everyone that had anything to do with those ads should be investigated for sexual misconduct l.",
        "Date": "2022-12-06",
        "Heading": "Take responsibility for your actions!",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Klaus Mauritzen",
        "Body": "Balenciaga promotes pedophilia. \n\nThey advertise with children teddybears in bondage. Children with sex symbols and books and photos from child molestors and authors who write about and paint about child cannibalism.\n\nProtect your children at all costs. \n\nIf you buy their products you support pedophilia. Simple as that.",
        "Date": "2023-08-25",
        "Heading": "Balenciaga promotes pedophilia",
        "Location": "DK",
        "Rating": 1
    },
    {
        "Author": "Katie March",
        "Body": "Balenciaga Cagole ankle boots purchased in Harvey Nichols’s .  Avoid. Heel came off and leather comes off the toes truly awful quality and neither Balenciaga or Harvey Nichols are interested- stay away from both.",
        "Date": "2024-07-09",
        "Heading": "Balenciaga Cagole ankle boots purchased…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Sammy Mizrahi",
        "Body": "I'm not a buyer \nwhen I'm bored I just look at their products and just laugh so hard, who the hell would wear this and especially for the price that's just insane ",
        "Date": "2025-03-16",
        "Heading": "very funny",
        "Location": "US",
        "Rating": 5
    },
    {
        "Author": "WavePositive",
        "Body": "If i see someone wear balenciaga, i know that it's a person not worth talking to.\nA moron. Balenciaga waders, balenciaga romeo loafers.. some of the, maybe even THE ugliest products ive seen in my life.\nClown shoes.\n\n\nYou couldve chosen to give to charity (because obviously you have plenty of money, and you choose to waste it) and buy normal shoes for a normal price but nope, you have to walk around with basically price tags still attached to your clothes to feel better than others.\nThis is not respectable behaviour.\nIt is disgusting and completely tasteless.\nAt this point youre just being a bad person.\n\n\nThe fact that they also sell heavily ripped jeans and shoes (paris) for thousands is beyond me.\nThe fact that people WASTE their money on it is even crazier, i would've never thought people would stoop so low to buy garbage for top dollar.\nHow is this not an insult to poor people? It's like your parodying homeless people.\n\nVanity/stupidity does NOT deserve respect.",
        "Date": "2025-01-22",
        "Heading": "Bad clothes for bad people",
        "Location": "NL",
        "Rating": 1
    },
    {
        "Author": "Trenton Yancey",
        "Body": "This company's founder would be ashamed of what it's become. Your products are ugly and outrageously overpriced. Anyone who buys your products is a small minded person. The only kind of people that I imagine would buy this 💩 is people like Jaden Smith. wealthy, uncultured people that follow trends. ",
        "Date": "2025-03-08",
        "Heading": "This company's founder would be ashamed…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "fletcher",
        "Body": "Sick B@st@rds promoting pedophiles.  SCUM!!!!!",
        "Date": "2022-11-23",
        "Heading": "Sick B@@tards promoting pedophiles",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Jason Howard",
        "Body": "Pedophiles trying to hurt kids and the lgbtq community. The gay community doesn’t support pedophiles. Pedophilia is a predatory behavior not a sexual orientation.",
        "Date": "2022-11-23",
        "Heading": "Pedophiles trying to hurt kids and the…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Prince Naveyafluz",
        "Body": "Was extremely happy that I managed to get 1 sneakers, 1 socks shoes and 1 sandals at Balenciaga Siam Premium Outlet. Now I am extremely pissed off! I am not able to do my VAT refund now because the sales associate gave me the wrong application form, it should be the yellow copy but instead she gave me the original copy. I only know when the VAT office rejected my at the airport now. Total I bought 64155 Baht and I should be able to get a 3560 Baht refund but due to the careless mistake from the sales associate, I am not able to enjoy my tourist privilege. Sales Associate should be trained well on this and it's quite disappointing to get such service from such a prestige brand. Not supporting Balenciaga anymore!",
        "Date": "2022-04-26",
        "Heading": "Not buying Balenciaga anymore",
        "Location": "SG",
        "Rating": 1
    },
    {
        "Author": "Bobby",
        "Body": "Worst company. Exploiting children and are not being held accountable",
        "Date": "2022-11-30",
        "Heading": "Worst company",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Rosi Sammur",
        "Body": "Balenciaga in Dubai flagship store won’t give me my money back. We got two pairs of sneakers yesterday, over a thousand US dollars each. Got to the hotel tried them on with regular socks and weren’t happy with the fit and look, went back to the store to be told, no refunds only store credit on that store, we are talking about over 2 thousand dollars spent 12 hours prior to us coming back with the items never worn still in the bag. They said NO refunds, I am a loyal customer of legit luxury brands like LV Channel Prada and Gucci and even though I have never tried returning any of their amazing products I know for a fact I could and get my money back into my card, it really is so disappointing and WRONG for a so called “luxury” brand to steal your money this way. DO NOT BUY from this brand, they are NOT at the level of their prices. Biggest mistake we’ve made so far, NEVER AGAIN. Now i have to try and sell these extremely overpriced sneakers.",
        "Date": "2021-10-23",
        "Heading": "Balenciaga in Dubai flagship store…",
        "Location": "AE",
        "Rating": 1
    },
    {
        "Author": "Anthony Johnson",
        "Body": "Imma need y’all to send me another pair of shoes cuz my shoes never arrived and that’s really sick y’all I had to pay all this money and never received my shoes like ……",
        "Date": "2023-02-03",
        "Heading": "Imma need y’all to send me another pair…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Vv",
        "Body": "I have never experienced such bad customer service from a retailer that is supposed to be deemed as LUXURY of some sort! \n\nThe online team are ridiculously unhelpful, RUDE & very entitled! \n\nAs a customer your thoughts do not matter to the which is horrifically CRAZY! \n\nPeople don’t spend your money with them such a waste of MONEY & TIME",
        "Date": "2018-07-13",
        "Heading": "I have never experienced such bad…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Carrie Smith",
        "Body": "Horrible perverse child grooming company! How can you sleep at night? Supporting pedophilia is sick!!! May you burn in hell!!!!!!",
        "Date": "2022-11-30",
        "Heading": "Horrible perverse child grooming…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Mila B",
        "Body": "Since Balenciaga didn't specify why we can then image why they cut ties with YE, seems Balenciaga doesn't support that fact that white lives matters in fact all lives matters. RIP Balenciaga.",
        "Date": "2022-10-24",
        "Heading": "Since Balenciaga didn't specify why we…",
        "Location": "CA",
        "Rating": 1
    },
    {
        "Author": "Djarvis Hansen",
        "Body": "How do i give zero stars?",
        "Date": "2024-02-17",
        "Heading": "How do i give zero stars?",
        "Location": "DK",
        "Rating": 1
    },
    {
        "Author": "Vicki Niethe",
        "Body": "You're a disgusting brand, promoting child pornography at its worst... your brand is now tarnished, no apologies or finger pointing is going to get you out of this.",
        "Date": "2022-11-24",
        "Heading": "You're a disgusting brand",
        "Location": "NZ",
        "Rating": 1
    },
    {
        "Author": "Seeshhh Boii",
        "Body": "Worst products, worst service, low quality shoes, cheap materials, definitely wouldn’t recommend as this brand has bad quality products, you should instead go LV or Gucci. Bought a triple S from italy and they started to chip off after 3 wears and they refused to repair it and even denied a credit note. Beware from this scam",
        "Date": "2023-12-05",
        "Heading": "Worst products",
        "Location": "AE",
        "Rating": 1
    },
    {
        "Author": "Teegan Mclaughlin",
        "Body": "After reading reviews got worried as they weren’t that good, but I’ve just received my shoes today and I had no problems at all came within a week with standard shipping also got updates, customer service was brilliant they got back to me within a couple of hours. Nothing to fault at all.",
        "Date": "2020-07-17",
        "Heading": "After reading reviews got worried as…",
        "Location": "GB",
        "Rating": 5
    },
    {
        "Author": "Matt Jnr",
        "Body": "Bunch of nonces, bunch of nonces",
        "Date": "2022-12-20",
        "Heading": "Bunch of nonces",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Sia Lebbie",
        "Body": "Sick bunch of people do not buy their brand you are sponsoring their cause to push paedophilia. They are a bunch of paedophiles, sick individuals",
        "Date": "2022-11-26",
        "Heading": "Sick bunch of people do not buy their…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "anad adi",
        "Body": "Barbaric company. The CEO of this place and all of the employees involved in their marketing must be investigated for crimes against humanity. Crimes against innocent children. How dare you sexualise baby girls, baby boys… you are a sick company!!!!!!! It needs to be CANCELLED!",
        "Date": "2023-01-22",
        "Heading": "Barbaric company",
        "Location": "SE",
        "Rating": 1
    },
    {
        "Author": "Sam Goody",
        "Body": "Won’t purchase anything from this company CANCEL",
        "Date": "2022-12-03",
        "Heading": "Won’t purchase anything from this…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Nicky Rowan Shore",
        "Body": "Ordered a pair of Balenciaga speed trainers for my daughter the black and white lace ups . Paid £565 waited over a week for delivery .\nThey finally arrived wrong product sent , these have pink on the sole ? Emailed them advising them of there mistake ? Totally not interested ? They were for my daughters 16 th Birthday. \nTold to return them then re order what a shame !! I’ve kept them because there is no guarantee I’d actually get the trainers I ordered and I had to have them for her surprise present . \nOrder at your own risk !! Wish I’d have read the reviews . \nI will never use this company again",
        "Date": "2020-11-15",
        "Heading": "Ordered a pair of Balenciaga speed…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Nebojša Savić",
        "Body": "I purchased a Triple S sneakers 4 months ago, and after only 4 months of use the canvas on the top of the shoe started tearing. I brought the shoes to the Amsterdam store for a complaint, and now they have informed me that they do not think that this is a quality issue and that they will not exchange or repair them. Never buy anything from Balenciaga!",
        "Date": "2024-05-01",
        "Heading": "Blaming quality issues on the customer",
        "Location": "NL",
        "Rating": 1
    },
    {
        "Author": "Maria",
        "Body": "Very disappointed about this company. I would like to give zero stars.",
        "Date": "2022-08-10",
        "Heading": "Very disappointed about this company",
        "Location": "DK",
        "Rating": 1
    },
    {
        "Author": "AM",
        "Body": "So I ordered a pair of Balenciaga Triple S the clear bottoms now I don’t know what’s happened to the quality but I’m always a size 5 In the Triple S the sizing was off, also the logo on one of the shoes was really bad like it had been stamped on and the Wording just looked wonky. Considering the price you would expect this to be perfect. I managed to get through to customer service saying what is going on with the quality, they just said don’t like them return them. So I did and I won’t be shopping with them again. After doing my research they no longer produce in Italy and the factory is now in China probably one of the factory’s that produce the copies. Quality has really gone down hill very disappointed.",
        "Date": "2020-11-27",
        "Heading": "So I ordered a pair of Balenciaga…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Charlotte",
        "Body": "I just had a very disappointing experience at Balenciaga at Illums, Copenhagen. A pair of sunglasses I bought at the store some time ago needed adjustment as they had gotten so loose they are unwearable. The sales person told me it was not their problem, they could not do anything about it and I could take them to an optician to get them adjusted at my own cost. I am really surprised that a high-end brand like Balenciaga - which I normally like - has such an arrogant attitude towards their products and clients. I guess I will be making my future purchases with other brands.",
        "Date": "2020-07-11",
        "Heading": "Very disappointing experience",
        "Location": "NL",
        "Rating": 1
    },
    {
        "Author": "Aiza Khan",
        "Body": "I am in utter shock as my delivery arrived today and it was completely different to what I had ordered. I ordered triple s trainers which cost me £695 however they sent me trainers that I did not want worth £650 even though I had paid 695 for the ones I wanted. I mean how could a BIG brand make such a silly mistake? I just cannot get my head round it. the fact that I waited about a month for them to get delivered, Not only that.... when I had bought them I checked my online banking after 3 days and the money was back in the account.... the next day I checked the money had been taken. This itself just shows me that they probably didn’t have my size in the ones I wanted BUT charged me for them and decided to send me some other ones. Furthermore I spoke to a client on the phone when I rang them and he was very apologetic however he told me he can not exchange and online they didn’t even have my size for the ones I originally paid for. I asked for the difference on what I paid and what I got and he said he will speak to the financial team and get back to me. I am not happy at all. I am a brand freak and I own a designer pair of trainers with most brands and never ever have I experienced a service from such a big brand. I’m so disappointed. They don’t even sympathise with you on the phone. I mean a sorry is not going to fix my problem isit? where’s my compensation for the trouble this has caused. I was thinking to order again from balenciaga but I will NOT be making this mistake ever again",
        "Date": "2020-04-23",
        "Heading": "I am so disappointed",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Eimhear Mc Barron",
        "Body": "Sick sick people have you seen them advertised kids ?!!!!!!",
        "Date": "2022-11-24",
        "Heading": "Sick sick people have you seen them…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Zoe Warrilow",
        "Body": "#savethechildren\n#CANCELBALENCIAGA \n#balenciagarepeadophiles",
        "Date": "2022-11-27",
        "Heading": "Vile vile vile",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Shelb",
        "Body": "Shame on ya'll",
        "Date": "2022-12-03",
        "Heading": "Shame on ya'll",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Anthony E",
        "Body": "Balenciaga more like Balenicaca \n Their clothes are not worth the price they don't even have taste in clothing and now they coming out the closet about child porn f#%k these chomos \n #teamye",
        "Date": "2022-12-01",
        "Heading": "Balenciaga more like Balenicaca",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Sami",
        "Body": "1 star for their campaign that advocate for children abuse",
        "Date": "2022-11-24",
        "Heading": "1 star for their campaign that advocate…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Arbnor gashi",
        "Body": "I bought a destroyed balenciaga t-shirt online for 650 euro, when it arrived it was to large fit for me and the quality was normal, but nothing significant. Then I called costumer service so I could change size or return and maybe go to the store to buy a size that fits me better. First they did not pick up the phone during the day until 4 pm, which was very frustrating, then finally when they picked up the phone they said I needed a return label/page so I can put it on the package in order to return. So they said they will send me the label, which they did not!! And I called them for 5 days straight and they all say the same thing, in the end I did not get the label and I have to just use this shirt. I also tried to mail them, I have to say, this is by far the most horrible experience I’ve had with clothing company service. There also other brands witch are the same. But for this to be “balenciaga” hottest brand right now, and when you pay 650€ for a shirt, this is bad! \nThe shirt is cool, but what the heck, you should treat your costumers better then that!",
        "Date": "2022-08-23",
        "Heading": "I bought a destroyed balenciaga t-shirt…",
        "Location": "NO",
        "Rating": 1
    },
    {
        "Author": "Narisa Belle",
        "Body": "This company is beyond ridiculous, they sent me a cup without the tap. I asked them to send me the tap of the cup and they said they can’t do that, You spend money on this company and this is the kind of service you get it makes no sence what so ever I will never purshace from this company y again they have zero resolution. It’s up to them to fix the solution not me . I asked for them to either send me the top of the mug or refund me it’s that simple. I’m on vacstion and i won’t be back until the end of summer and there asking me if i can have someone mail it back to them this must be a joke! It’s actually sad that a company that makes this much money treats a customer like this. No wonder they have horrible reviews. I spoke with a manager named Antone and there was absolutely no resolution just wasted my time\n\n\nSent back the item it has been 1 full week since they have recieved the items Tracking says delivered and i still don’t have a refund",
        "Date": "2022-06-22",
        "Heading": "This company is beyond ridiculous",
        "Location": "CA",
        "Rating": 1
    },
    {
        "Author": "Ben",
        "Body": "Terrible brand ,terrible marketing \nNever Give money for this",
        "Date": "2022-11-26",
        "Heading": "Terrible brand",
        "Location": "SK",
        "Rating": 1
    },
    {
        "Author": "Joanna Mantzari",
        "Body": "One star is too much, wish I could give minus 10 stars for their trash clothes and pedophile staff.",
        "Date": "2022-12-05",
        "Heading": "Pedophiles",
        "Location": "CH",
        "Rating": 1
    },
    {
        "Author": "Natalie Shapiro",
        "Body": "THE WORST BRAND EVER. I purchased shoes and only worn it for 6 months when they fell apart. I reached out to customer service and they refused to repair it because the damage is due to use . What are we paying high quality price for when they products are so cheaply made that they fall apart due to a normal wear . Complete garbage. Save your money and choose a different brand to spend your hard earned money on ",
        "Date": "2025-01-02",
        "Heading": "THE WORST BRAND EVER",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Kenny Aguilar",
        "Body": "Overpriced brand, I received a very poor quality product and the shipping took a week longer than expected.",
        "Date": "2021-12-10",
        "Heading": "Overpriced brand",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Linsey Hilley",
        "Body": "Let me begin with they are a company that supports pedophilia. And not only that their clothes are extremely ugly and overpriced. Like if you shop here who hurt you.",
        "Date": "2022-12-01",
        "Heading": "Let me begin with they are a company…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Liv Allen",
        "Body": "I wouldn’t recommend balanciaga at all to anyone!!! How I’ve been treated is ridiculous!! I spent £565 on a pair of shoes! Don’t get me wrong the shoes were lovely! But one arrived in a size 6 (what i ordered) and one come in a size 5!! Absolutely disgusting! They wasn’t bothered I have tried and tried to send back to I finally get to send them back, and now ups have had my parcel for over a week! I’m going to my local press company if it don’t get sorted soon??!",
        "Date": "2021-02-18",
        "Heading": "I wouldn’t recommend balanciaga at all…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Alicia Forney",
        "Body": "Company that promotes child *orn and #edophilia is no company worth a damn penny, not from my family or yours! Done",
        "Date": "2022-11-27",
        "Heading": "romotes child *orn and…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Jae Trifonov",
        "Body": "Bad customer service, ugly clothes. Was trying to buy a hand bag and couldn't get clear answers or a decent sales person. You can just keep it all.",
        "Date": "2019-04-09",
        "Heading": "Bad customer service",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Ziggy",
        "Body": "You buy a $800 sneaker and wear them every so often because you want to take care of them. The stitching snaps and pops on the stretchy part of the sock where it is suppose to be durable. Can’t even repair the sneaker and only had it for a few months. I only wore them about 7 times. Don’t waste your money might as well get a pair off of DHgate for $45 they made in the same place in China across the street at another factory 🤦‍♂️",
        "Date": "2019-10-11",
        "Heading": "Balenciaga Trainers",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Hippo Farm",
        "Body": "Vile absolutely demented! Anyone who buys,sells,supports,funds,markets Balenciaga is a pedophile! This company is evil they are exploiting children sexually and ruining their Innocence! Demonic for the sake of fashion and their taste includes underage children. Sick.Awful trends to begin with that are total trash. Garbage throw all their crap in the trash! Shut this nonsense down immediately. Protect our children at all costs.",
        "Date": "2022-12-04",
        "Heading": "Vile absolutely demented",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Nic",
        "Body": "Beware of the poor quality of their products - I have a pair of Speed 2.0 lace-ups which had defects on one side. I had sent photos to Balenciaga to get this repaired. This was met with a claim that this was a wear and tear issue for what is clearly a manufacturing defect. Very ridiculous reasons were given.\n\nI have other pairs of Speed which makes the defect glaringly obvious and offered to bring the shoes to their store for them to assess in person but this was strangely refused. Perhaps they do not wish to admit the QC failure?\n\nVery poor quality product, and very poor customer service. \n\nWill not make any future purchase from this house given this experience and all the controversies.",
        "Date": "2024-02-24",
        "Heading": "Ridiculous excuses for manufacturing defect",
        "Location": "SG",
        "Rating": 1
    },
    {
        "Author": "john paul Brennan",
        "Body": "Absolutely disgusting what Balenciaga have done using children in that manner! Pure evil and hints of a massive paedophile ring operating under our noses. Why are law enforcement agencies not investigating this group ?",
        "Date": "2022-12-01",
        "Heading": "Absolutely disgusting what Balenciaga…",
        "Location": "IE",
        "Rating": 1
    },
    {
        "Author": "Chloe Davison",
        "Body": "ABSOLUTE POOR CUSTOMER SERVICE! I paid £695 for a pair of trainers and they currently have a manufacturing fault and I have waited for a month now for a solution… still waiting. Being told incorrect information and lies every time I call them. Would not recommend!!!!!",
        "Date": "2021-10-01",
        "Heading": "ABSOLUTE POOR CUSTOMER SERVICE",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Joanne Chapman ",
        "Body": "I've been dealing with Balenciaga for a good few months now as I bought a pair of what I thought to be authentic Speed Socks from Instagram. When they arrived it was clear to see they were fakes (despite paying over £500 for them) I then purchased the same trainers straight from Balenciaga and they came within 4 weeks, not ideal but at least I knew I was getting the real thing. They also asked me to send them the fakes and they would investigate free of charge. What I already knew was confirmed, I had been sold fakes, they have kept hold of the replicas and are going to deal with the Instagram company themselves. Very impressed by this.",
        "Date": "2021-04-22",
        "Heading": "I've been dealing with Balenciaga for a…",
        "Location": "GB",
        "Rating": 4
    },
    {
        "Author": "maggie liu",
        "Body": "I have always been a fan of Balenciaga, but I'm seriously questioning their quality now. My husband bought a pair of their Speed Sock shoes, and after just over a year, the sole started coming off on one of them, and they began squeaking when he walked. It’s pretty embarrassing. When he contacted their customer service, they simply directed him back to the store where he made the purchase. \n\nWhen he went to the store, the response was shocking. The store manager, Duy Tring, at the Valley Fair location in San Jose, California, basically told him that it’s normal for the shoes to wear out if they’re worn frequently and then subtly dismissed him without offering any real help. To make matters worse, another sales associate blatantly ignored him when he asked for further assistance and instead attended to a new customer who had just walked in. It was clear they had no interest in resolving the issue.",
        "Date": "2024-08-18",
        "Heading": "Questionable quality and bad post purchase service ",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "pelister noah Mem",
        "Body": "YOU SICK FREAKS, THINKING OF CHILDREN AS SEX OBJECTS. PEDO'S",
        "Date": "2022-11-30",
        "Heading": "Child abuse",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Kaylee Maxine Cullen",
        "Body": "Child exploitation in the most disgusting way imaginable anyone that supports or purchases from this company is an accessory to an evil agenda! SICK!!",
        "Date": "2022-12-04",
        "Heading": "Child exploitation in the most…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Amiro Arkvaz",
        "Body": "You guys are the lowest of the lowest.",
        "Date": "2022-11-25",
        "Heading": "Absolute disgusting",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Faas Visser",
        "Body": "Great items. Some quality not too great but overall great brand and excellent customer service",
        "Date": "2021-03-09",
        "Heading": "Great items",
        "Location": "NL",
        "Rating": 5
    },
    {
        "Author": "Kayla Nozawa",
        "Body": "Trash company that promotes pedophilia, blames others, and doesn’t take responsibility",
        "Date": "2022-11-26",
        "Heading": "Trash company that promotes pedophilia",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Michael",
        "Body": "Where do I start! \n\nI ordered a €750 pair of runners as a gift a few weeks ago. From the off it was a disaster.\n\nFirstly, Balenciaga (through their faulty website) took my money without making the order. This took 2 WEEKS to fix, they couldn’t find the order on their side. Eventually I had to involved my bank to fix the situation. \n\nSome of the staff where horrendous to deal with, rude and obnoxious to the paying customer. Talking down to me constantly and trying to push blame onto myself when it was their system all along. \n\nAfter the 2 weeks I was refunded and provided with a ‘next day’ delivery voucher for my troubles. The thing is, ‘next day’ delivery to Balenciaga means over a week!! Still have not received the trainers I ordered weeks ago. \n\nI rang customer service again to try and sort the situation out. They told me it’s my fault, I ordered the shoes at 4pm instead of 3pm so the next day delivery doesn’t count (I’m not even joking here!!!!). \n\nI asked for the order to be cancelled which I was told will take probably 2 weeks between the shipment being returned and then getting the funds back and as it’s now close to Christmas I begrudgingly went ahead with the order.\n\nReally liked Balenciaga as a brand prior to this, will NEVER buy a stitch from them again & advise everyone to do the same.",
        "Date": "2020-12-07",
        "Heading": "The absolute worst shopping experience I ever had on every leve",
        "Location": "IE",
        "Rating": 1
    },
    {
        "Author": "Dee Clayton",
        "Body": "Do not buy Balenciaga online - they take no responsibility for an item not delivered. £1350 bag gone missing and this company so far have given me no comfort that they will do anything about this. I am having to wait days and days without knowing whether we get the product or our money back. I would never buy from them again - i feel devastated not being able to give this gift for my daughter’s 21st and xmas present. What ahould have been a dream come true has turned into a nightmare",
        "Date": "2021-12-28",
        "Heading": "Do not buy Balenciaga online",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Tommy Hackett",
        "Body": "Promotes child pornography",
        "Date": "2022-11-23",
        "Heading": "Promotes child pornography",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Ty Markiewicz FLXERS",
        "Body": "I love fashion this brand top tier in my eyes sure they did some really dangerous and damaging things to there company but who you to say that nobody perfect I hope they learn from there mistakes but I’m always rocking my Balenciagas regardless",
        "Date": "2023-10-21",
        "Heading": "They are a amazing image in fashion world can’t take that from this company",
        "Location": "US",
        "Rating": 4
    },
    {
        "Author": "Dina",
        "Body": "I bought the Balenciaga speed 2.0 for 695 euros. Very beautiful but within a few months they tear at the sole. I was shocked?! So much money for such a bad quality. I did get my money back but I am very disappointed.",
        "Date": "2021-05-29",
        "Heading": "Speed 2.0",
        "Location": "NL",
        "Rating": 1
    },
    {
        "Author": "Jazzy Que",
        "Body": "Over priced trashbags..literally.",
        "Date": "2022-11-28",
        "Heading": "Over priced trashbags..literally.",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Roberta",
        "Body": "Cancel this brand, they promote child abuse.",
        "Date": "2022-11-28",
        "Heading": "Cancel this brand",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Ian james",
        "Body": "DO NOT PURCHASE ANYTHING THIS COMPANY DIRECT !! Appalling lack of customer service.\nI purchase a pair of shoes for my son for Christmas and 4 months later the leather came away from the stitching on the side of the shoe.the leather is stitched to the side of the sole and doesn’t continue under the door like most shoes.\nBalenciaga told me it was misuse ,they based this decision on images from emails and basically fobbed me off !! \nIrrelevant of the price of the shoes the lack of common sense and customer service ethic is appalling.\nTotally fobbed off ,a disgrace !! \nI have posted all over social media and will continue to give negative comments to anyone who is looking to buying anything from this joke of a company",
        "Date": "2018-05-23",
        "Heading": "DO NOT PURCHASE ANYTHING THIS COMPANY…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Noufal Poyili",
        "Body": "Dot purchase online, below cost porduct and other product, its fake,, my order also i did not received, no response for his service team also,",
        "Date": "2022-04-23",
        "Heading": "Dot purchase online",
        "Location": "IN",
        "Rating": 1
    },
    {
        "Author": "Aldo Picano",
        "Body": "i bought some trainers from on line from balenciaga\nnever arrived they use ups to delivery them please dont mention them the low of the low delivery company, they never delivery them, costumer services is absolutely rude after 1hr waiting.\ncalled balenciaga they where more rude  then ups\ni cancelled my order \nnever by again on line a balenciaga",
        "Date": "2020-01-07",
        "Heading": "i bought some trainers from on line…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Cris",
        "Body": "Balenciaga in the Miami Design District has incredible service. I bought a pair of shoes that I didn’t like once I put them on at home, and they quickly arranged for an exchange over text message, for a completely different style. They set up the exchange so that I could pull up to valet, run inside, switch pairs, and walk right back out. The new pair was all wrapped and boxed and ready to go. They offered a water bottle to go and even remembered my dog’s name. Really above and beyond. ",
        "Date": "2025-04-17",
        "Heading": "Five star service!",
        "Location": "US",
        "Rating": 5
    },
    {
        "Author": "Carl",
        "Body": "All I want to do is cancel order# 0110Z97FE2038F but I can’t because when I first called nobody was answering the phone so I called my bank filled a dispute and now today my bank took the money back so now it’s like I got scammed out $1,033.50 over a pair of shoes. My bank keeps telling me hey we can’t help you call PayPal or call the shipping company or the merchant loser. So I call PayPal they can’t help me they tell me call my bank back or the shipping company I call the shipping company they say call your bank or the merchant. I finally get in contact with the merchant. Yeah somebody from there terrible customer service answered I couldn’t believe it. Only for them to tell me oh we tried to send you a refund but we weren’t able to because of a charge back so you have to call your bank sorry. So I call my bank for the 3rd-4th time today and they tell me I’ll have to file a complaint with bbb cause they can’t help. These guys are really trying to scam me out of $1,033.50",
        "Date": "2020-10-05",
        "Heading": "Please please don’t shop with these people",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "eva",
        "Body": "i ordered some balenciaga triple s shoes online as they were sold out in the shop and i didn’t think anything of it as celebrities wear this brand , however after ordering i looked at reviews and with them been very disappointing with people saying they never received their parcel e.g i got very concerned after not receiving any emails saying my shoes had been dispatched 3 days after purchase( i paid for the 1-3 day delivery) so i rang up and they were helpful and told me they had been dispatched and i was going to receive them the following day and i did . overall i am impressed just the email was never sent",
        "Date": "2020-02-19",
        "Heading": "i ordered some balenciaga triple s…",
        "Location": "GB",
        "Rating": 4
    },
    {
        "Author": "Russell ‘S Hippop Life",
        "Body": "What does “pending release from a Government agency and will be returned to the sender ”mean？？？Is a pair of sneaker something illegal？Client service is BS，they never respond. The tracking information hasn‘t been updated for 5 days！！！I swear it can’t be worse anymore！",
        "Date": "2020-08-26",
        "Heading": "Stop Buying from Balanciaga Official Website",
        "Location": "CA",
        "Rating": 1
    },
    {
        "Author": "Edwin Quietzsch",
        "Body": "Absolutely disgusting, should never been touched or bought by anyone again. I hope the people in the company will suffer from what they have done to society and their disgusting behaviour.",
        "Date": "2022-11-30",
        "Heading": "Absolutely disgusting",
        "Location": "AE",
        "Rating": 1
    },
    {
        "Author": "Per Christian Strand",
        "Body": "1. The bag was on the webshop, but still not available. \n2. The webshop suggested to send it from the local shop in Hamburg.\n3. Making a mistake that caused UPS to bill me for import expenses.\n4. It took one month for Balenciaga to correct the mistake.\n5. Countless calls and messages to customer service with no or pointless responses. The courier also contacted Balenciaga with no response.\n6. When the bag finally arrived it had obviously been used for demonstration in the showroom.\n7. No apologies, compensation or follow up from Balenciaga. \n",
        "Date": "2025-04-27",
        "Heading": "Worst shopping experience ever",
        "Location": "NO",
        "Rating": 1
    },
    {
        "Author": "Martin Hirst",
        "Body": "Bought a pair of Track 2 trainers from the Sloane Street store. Returned after 2 days as changed my mind. Goods never opened, nor worn. No refund offered despite receipt expressly referring to company website terms and conditions which states refund within 30 days if goods returned unworn. Staff were friendly but unhelpful. The shoes are made in China yet cost £615. Quality dubious. Will never purchase this brand again.",
        "Date": "2019-11-19",
        "Heading": "No refund. Wholly unacceptable and grossly unfair",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Mariam abd",
        "Body": "Pedo corruption of a company. Disgusting fake appoligie! We a know how many people would have to approve of these campaigns. Sickening will never support such brand.",
        "Date": "2022-11-26",
        "Heading": "Pedo corruption of a company",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Linz",
        "Body": "Love the speed socks!! So comfy and stylish !! Did go back and forth for quite some time on the right shoe size to choose. As I’m always in between sizes and they do not offer half sizes in these. I ordered both a 5 and 6. I am a men’s / boys size 4, so I was just really torn on the correct fit. It’s all about how you want them to fit really ,5 [35] being snug and a 6 [36] being more spacious. I ended up keeping the 5 thankfully because they do fit very well and stretch a bit so they don’t feel so snug. Literally feel like socks.  If I would have kept a 6 I think I would have been swimming in them. Customer service was always there when I needed them , also returns on the size I decided not to keep and then others bought was very easy with no issues. I’ve had these for a couple months now , I just hope I’m one of the lucky ones and they last! Other reviews really help the good and the bad. But so far for me mine has been a good experience.",
        "Date": "2021-07-06",
        "Heading": "Love the speed socks!",
        "Location": "US",
        "Rating": 4
    },
    {
        "Author": "Donna J",
        "Body": "Poor customer service, poor judgment",
        "Date": "2022-11-23",
        "Heading": "Poor customer service",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Tim G",
        "Body": "Crash and burn. Crash and burn.  Crash and burn.",
        "Date": "2022-12-19",
        "Heading": "Crash and burn",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Nel",
        "Body": "Absolutely vile paedophile company u sick f#$ks never ever will I buy ur brand... use suck...",
        "Date": "2022-11-25",
        "Heading": "Absolutely vile paedophile company u…",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Maria Evagora",
        "Body": "Went to the store in Rome to buy some trainers that my daughter wanted. I was stunned by the lack of service. They literally turned their nose up at us and looked at us like we were low lives!!! I requested what I wanted and the assistant just looked at me for a few moments as if he was thinking \"really\"? I was so disgusted that I just said \"you know what, don't bother\" and walked out. I've been in the London store recently as well and encountered similar disdain from their staff, but thought it was a one-off bad experience, I was wrong it seems to be a Balenciaga trademark. You should send your staff to the training team for Gucci, Bulgari or Burberry, they can show you how it's done !!!",
        "Date": "2019-07-25",
        "Heading": "Disgusting Service !!",
        "Location": "CY",
        "Rating": 1
    },
    {
        "Author": "Florin Stefan",
        "Body": "Satanic and Barbaric BS company….\n\nShould be taken off market. \n\nFirst of all ur clothes are DISGUSTING….. looks ugly as f… \nWhoever buys them, have no taste, no brain. \n\nOUT OF THE MARKET!!!!!!",
        "Date": "2022-12-31",
        "Heading": "Satanic and Barbaric BS company….",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Joe",
        "Body": "Sickening bunch of sickos running this brand DONT SUPPORT THEM BY BUYING BOYCOT!!!",
        "Date": "2022-11-25",
        "Heading": "Sickening bunch of sickos running this…",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Gabe Abraham",
        "Body": "Horrible company. The people who run this make me sick and need Jesus. Do not support",
        "Date": "2022-12-31",
        "Heading": "Horrible company",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Genc matematik",
        "Body": "Never will I ever buy again.",
        "Date": "2022-11-28",
        "Heading": "Never will I ever buy again.",
        "Location": "SE",
        "Rating": 1
    },
    {
        "Author": "Megan Young",
        "Body": "Extremely disappointed, ordered a £600 balenciaga hoodie for it to never even turn up, consecutively rung balenciaga to notify them that is says it has been delivered on the website but i hadn’t received the parcel and they weren’t interested. It is 3 weeks later now and i have still not received the parcel or a refund, i have been ringing them constantly to see what is being done about this as i am £600 out of pocket and each time they haven’t done anything towards this and say it is on their to do list, extremely disappointing as this was a Christmas present and i am waiting on the refund to re order a different Christmas present. For such a high brand and expensive products it is very poor customer service and i shall not be ordering from here again.",
        "Date": "2020-11-26",
        "Heading": "Extremely disappointed",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Samson Ionut",
        "Body": "Pedofils, stay away and don't associate with them, they will pay for this",
        "Date": "2022-12-02",
        "Heading": "Pedofils",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Miuccia",
        "Body": "I've made a few purchases at Balenciaga, and the entire experience went quite well, one item was bracelet that was really tight and I tried to wear it several times but always ended up having to remove it because was really uncomfortable, I wrote to balenciaga and they told me I could return it, which was pretty cool from them, so far I have a positive experience, except for my request for measurements for a wallet chain and the answer was they could not answer me about it, that is a little odd but ok.",
        "Date": "2019-07-28",
        "Heading": "I've made a few purchases at…",
        "Location": "PT",
        "Rating": 5
    },
    {
        "Author": "Barbra",
        "Body": "I've always love this brand as I don't have 3 Balenciaga City Handbags.\n\nI purchased a Balenciaga speed trainer in Harrods London last Oct for my son.  last month we noticed that there are some discoloration on the bottom of the shoes it turned to pinkish/reddish color and I tried to work it out with their customer service and they wont even help us repair or even give us compensation for it.",
        "Date": "2019-01-16",
        "Heading": "Balenciaga Trainers - Product defect",
        "Location": "US",
        "Rating": 5
    },
    {
        "Author": "Mike Garside",
        "Body": "Customer Service lets this company down.\n\nBought some sneakers, but their was a problem will delivery, they arrived 1 week after the expected date. I found the customer service staff very rude and unhelpful.",
        "Date": "2022-07-24",
        "Heading": "Customer Service lets this company…",
        "Location": "AU",
        "Rating": 4
    },
    {
        "Author": "hana elsamin",
        "Body": "I had scratches on my waist bag Balenciaga repaired and fixed my bag, they shipped my bag back to egypt on their own expense they even paid egyptian custom fees on my behalf. The bag stayed with UPS for almost 2 months they kept following up with me until they were assured I received my bag . So my bag was fixed shipped and even custom fees were all paid by them. The staff were beyond professional and nice during the month and half when my bag got stuck with UPS . For me this was considered the best customer service I've ever received.  Balenciaga la roca village Spain team , thank you so so much",
        "Date": "2024-01-25",
        "Heading": "I had scratches on my waist bag…",
        "Location": "EG",
        "Rating": 5
    },
    {
        "Author": "Laura Dickie",
        "Body": "Terrible quality. Paid 650.00 for pair of trainers only worn about 10\nTimes in last 6 months they have ripped and worn so badly Customer service useless and unresponsive",
        "Date": "2020-10-17",
        "Heading": "Terrible quality",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Nad",
        "Body": "Just see the recent balenciaga post with a child holding a Teddy bear wearing Pornograhpic clothing and items displayed so disgusting and outrageous. If I see anyone wearing this I will educate them! Stop looking upto influencer and get on with your life",
        "Date": "2022-11-30",
        "Heading": "BALENCIAGA CHILD PORN!",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Daniel Müller",
        "Body": "No clue why the total star rating is that low, but my experience at one of stores in Amsterdam was exceptional. Picked up my 3XL shoes there and will be certainly be back for more items!",
        "Date": "2024-08-10",
        "Heading": "Decent store",
        "Location": "NL",
        "Rating": 5
    },
    {
        "Author": "Gary Cox",
        "Body": "Purchased a pair of lace runners after 2 days the lettering started coming off. I have returned the items and had no refund or any sort of communication. Absolutely appalling for the size of company. No trainers and £500+ out of pocket.",
        "Date": "2019-06-05",
        "Heading": "Poor product and even worse customer service.",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Cleto Vasquez",
        "Body": "Went online to look at some polo shirts and you think for the money they charge for this clothing, they might be able to afford some real models instead of going to the local skate park for their models, I need to see what clothing could possibly look like before buying it but these models made it scary.....",
        "Date": "2018-08-01",
        "Heading": "Went online to look at some polo shirts…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Caitlin",
        "Body": "DO NOT ORDER FROM HERE.\n\nI ordered a size 36, (UK size 3) and it took two weeks to come and they sent a size 38, (UK size 5) you have to return them back to Italy from the UK, when they should've sent the RIGHT size. Don't waste your time or money.",
        "Date": "2020-03-10",
        "Heading": "DO NOT ORDER FROM HERE.",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Josh Red",
        "Body": "Evil company run by pedophiles",
        "Date": "2022-11-28",
        "Heading": "Evil company run by pedophiles",
        "Location": "IE",
        "Rating": 1
    },
    {
        "Author": "Johnny Williams",
        "Body": "A company that openly supports paedophilia. Disgusting and revolting should be completely disbanded and taken off the shelves. How these evil people look at themselves without throwing up baffles me. EVIL PEDOS!",
        "Date": "2022-11-28",
        "Heading": "A company that openly supports…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "TiggyTash",
        "Body": "Absolutely DISGUSTED by your new campaign having young innocent children holding teddies in BDSM outfits. It’s absolutely SICK! The only company that would do this is one that openly supports pedophilia and RAPE. Your brand should be cancelled. And investigated. And your clothes SUCK.",
        "Date": "2022-11-23",
        "Heading": "This brand supports pedophilia of children",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Sophia",
        "Body": "bought a balenciaga downtown bag on july 2nd, it said it would be shipped from 5-8 business days. it’s now july 24 and i haven’t even gotten a shipping confirmation. contacted customer service and they tell me this bull s that it comes from italy so it has to be shipped. my amazon packages from china ship faster than this. BUY DIOR INSTEAD!! they ship within 2 days!!! POS company!",
        "Date": "2022-07-24",
        "Heading": "BOOOO",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Anisah Hezrin",
        "Body": "Great services, great qualities and great price. I'd like to shopping more in here soon. Thanks!",
        "Date": "2019-11-21",
        "Heading": "Great services",
        "Location": "MY",
        "Rating": 4
    },
    {
        "Author": "Steijn",
        "Body": "Really bad customer service.\nBought a €700 pair of sneakers,\n (for sure one of the most expensive sneakers in the retail market) they started to fall apart after a year.\nCustomer service is not willing to help with repairs.",
        "Date": "2021-02-18",
        "Heading": "Really bad customer service.",
        "Location": "NL",
        "Rating": 1
    },
    {
        "Author": "Sophie high",
        "Body": "Today I bought my first pair of Balenciaga triple S trainers with the kind help off Raul one of the Harrods personal shopper workers, he was really helpful, helped me with sizing and checking availability even give me a discount code for delivery over all a really great customer service outcome, thank you.",
        "Date": "2021-01-22",
        "Heading": "Great customer service",
        "Location": "GB",
        "Rating": 5
    },
    {
        "Author": "Cee Cee",
        "Body": "Customer service over the phone are ignorant rude and not helpful at all. The second time now, I have received a dirty  damaged shoe. Offered no compensation or reimbursement. I was told item is checked, clearly not as even the shoe box was damaged! The courier box was in perfect condition but the actual shoe box was damaged. Terrible condition for such an expensive shoe. Terrible customer service. Do not order as twice now my shoes have arrived damaged!",
        "Date": "2021-01-12",
        "Heading": "Rude ignorant Customer service. Not helpful!",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Klrsten Ekrub",
        "Body": "I confirmed full details of my online purchase to Balenciaga at the beginning of September.  The product purchased I don’t believe is acceptable as the sole has started coming away from the material at the front. And around the sides of the shoe you can see what appears to be some kind of sealant. I have followed the procedure suggested by Balenciaga by putting my concern in writing. I received a response requesting pictures. I provided pictures the same day and waited 10 days without a response. I chased this up again, to be told the pictures were not clear enough. I then sent numerous further pictures the same day (9th October) to which I still have not received any update. I have chased this up twice since the 9th but have not been acknowledged. I have since asked for my complaint to be escalated but as expected have not received a response. I have purchased many times from Balenciaga without issue, which leads me to believe this particular purchase is faulty and not up to standard, however the customer service is extremely poor and not what I would expect from a designer of this profile.",
        "Date": "2021-10-28",
        "Heading": "Faulty product and poor customer service.",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Sam Friedman",
        "Body": "Great products!\nNot sure why all these bad reviews! \nGot the La caguiole bag for men and love it! \nAll perfect for me.",
        "Date": "2024-10-20",
        "Heading": "Great products!",
        "Location": "US",
        "Rating": 5
    },
    {
        "Author": "Dean Hamby",
        "Body": "This company as an advocate for child abuse.   Their clothing, company and people should be airdropped into a volcano.   Scum",
        "Date": "2022-12-01",
        "Heading": "This company as an advocate for child…",
        "Location": "CA",
        "Rating": 1
    },
    {
        "Author": "John Mann",
        "Body": "So this is a company that tries to use paedophilic images of children to sell grotesque plastic crap.\nIf you decide to buy their hideous garbage, you may want to examine your life-choices.\nIf you have children or ever were one...and still want to be seen in their trash...well, you are making a big statement about who you are.",
        "Date": "2023-03-15",
        "Heading": "Company supports paedophilia for profit",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Fra Byr",
        "Body": "Do not buy from this brand or any of its supporters. This brand uses scenes of child sexual abuse victims to make money. They do not care for the thousands of children who are maimed and injured, both physically and psychologically by sexual abuse. They do not care about the survivors of child sexual abuse who are triggered by the shameful advertising of this brand. Never in all my life have I been so disgusted with a brand, and so disgusted by the celebrities who are refusing to denounce this brand. Shame on you, shame on you for allowing images of children to be used in your disgusting advertising. I hope you are cancelled. I hope you will feel shame for these actions.",
        "Date": "2022-11-29",
        "Heading": "Do not buy from this brand or any of…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "C. diab",
        "Body": "Bunch of thieves, your goods are never worth the money, and your manners aren't even human anymore, I hope your business closes forever!",
        "Date": "2022-11-30",
        "Heading": "Bunch of evil thieves",
        "Location": "IE",
        "Rating": 1
    },
    {
        "Author": "Karin Schutz",
        "Body": "This company can improve by not provoking and using children in their awful publicity campaigns.",
        "Date": "2022-11-26",
        "Heading": "children are innocent, we have to make sure they keep this way.",
        "Location": "ES",
        "Rating": 1
    },
    {
        "Author": "Louie Clawson",
        "Body": "What a EVIL PEDOFILE RING they have going on there...They take Photography still with BDSM and children in it to exposing BOOKS now with Authors who are into TORTURED children in there photo pic in their online catalog...The whole WORLD has been exposed to it and millions are pissed off that this company DOES NOT even try to hide it...This company needs to be investigated to the fullest extent. Including the children you had in those BDSM photos...Are you also involved with sex trafficking children??? That will be investigated soon...",
        "Date": "2022-11-27",
        "Heading": "What a EVIL PEDOFILE RING they have…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Assem O. Kabesh",
        "Body": "Sent my bag for repair since July 2021 and was promised it will take 8-12 weeks. It's been 10 months no and there is nothing. All I get is empty promises. Emails and phone calls go unanswered with with resolution so far. What a shameful and frustrating experience for a brand like Balenciaga. Will never buy anything from them again. They really do not deserve our business. What a shame.",
        "Date": "2022-02-03",
        "Heading": "10 months for a bag repair and Miserable service",
        "Location": "AE",
        "Rating": 1
    },
    {
        "Author": "Alph.Hunter",
        "Body": "Too many people have woken up. You pizza loving, child murdering 'elites' will all be unmasked before your time is done. Pathetic losers, so smug thinking you could hide in plain sight, rub it in the faces of us 'minions'. Your day is coming.",
        "Date": "2022-12-02",
        "Heading": "The 'elites' will all be unmasked",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Anonymous",
        "Body": "I returned a complete order within the return policy guidelines and used all of the original packaging and supplied pre-paid Balenciaga UPS return label.  When they processed the return, the amount was incorrect.  I contacted them and customer service (Ana) states that I did not return one item in the order, which is COMPLETELY FALSE.  I asked them to conduct an internal investigation and/or with UPS.  I have no reason to believe they conducted an internal investigation and they wanted me to contact UPS, even though I cannot, since I am not the account holder of the UPS label (Balenciaga is).  They have deflected any responsibility and have not been helpful in any way.  I am now noticing in other reviews that other people have had similar issues.  Needless to say, Balenciaga needs to straighten these issues out with their customers, if they plan on keeping business.  I have also filed a complaint with the Better Business Bureau, so that something is done about their ill behavior towards customers.",
        "Date": "2021-02-16",
        "Heading": "Dishonest Customer Service, Return Item Mysteriously Missing",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Amy Guan",
        "Body": "HORRIBLE CUSTOMER SERVICE!!! I CANNOT REACH ANYONE TO CANCEL MY ORDER. I USED THE WRONG METHOD OF PAYMENT. I CALLED 20x AND REACHED SOMEONE ONCE. THEY SAID THEIR SYSTEM IS DOWN AND CANNOT CANCEL ORDERS TILL LATER?? WHAT TYPE OF BS IS THAT? THEY RECEIVED MY EMAIL BUT TOO LAZY TO REPLY! THIS IS RIDICULOUS!!!!! I WANT TO CANCEL MY DAMN ORDER BEFORE IT SHIPS OUT!!!!!!",
        "Date": "2020-07-14",
        "Heading": "HORRIBLE CUSTOMER SERVICE!!",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Charlie Hyatt",
        "Body": "Pedofile group disgusting",
        "Date": "2022-11-27",
        "Heading": "Pedofile group disgusting",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Angela docherty",
        "Body": "Wouldn’t even rate it one star…blatant in your face child exploitation… a company who makes no mistake to have their sick twisted fetishes in plain sight for everyone to see…very dark and disturbing designer with no morals! \nSatanic",
        "Date": "2022-12-01",
        "Heading": "Wouldn’t even rate it one star…blatant…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Pavel T.",
        "Body": "Evil company",
        "Date": "2022-11-28",
        "Heading": "Evil company",
        "Location": "DK",
        "Rating": 1
    },
    {
        "Author": "Squash player",
        "Body": "They charge £370 for a charity t shirt and give the charity just £37.\nHow low can a company get",
        "Date": "2018-11-26",
        "Heading": "Charity scammers",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Nakul Malhotra",
        "Body": "By far the worst customer experience from any brand, let alone a so called “luxury” brand. \n\nPurchased a bag which ripped apart on first couple of uses, the team has stopped responding and kept our original product since 3 months.\n\nBeyond professional, sustainable, ethical, and legal!!!",
        "Date": "2024-05-28",
        "Heading": "SCAMMED by Balenciaga Bicester Village Store ",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Lux Sur",
        "Body": "“Children are a gift from the Lord; they are a reward from him.” “Jesus said, 'Let the little children come to me, and do not hinder them, for the kingdom of heaven belongs to such as these.' ” “Children's children are a crown to the aged, and parents are the pride of their children.”",
        "Date": "2022-12-13",
        "Heading": "“Children are a gift from the Lord",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Saturnina Parra",
        "Body": "Best high end fashion store on the market today, Great customer service great selection of clothing etc you get your moneys worth and more 👌",
        "Date": "2024-03-20",
        "Heading": "Best high end fashion store on the…",
        "Location": "US",
        "Rating": 5
    },
    {
        "Author": "Marijam Munoz",
        "Body": "Balenciaga gave me a damage bag then I had to make an exchange and then waited and balenciaga sent me the same damage bag that I sent them I was pissed !!!! Then I tried returning it again I know they got the bag but they never gave me any information I looked online that bag is sold out now wow !!!! I dnt know what they gonna do with it I’m really pissed off customer service sucks !!!!! I would like to sue them I’m gonna see how I dnt know if I can .. I ddnt expect this from them i really like their design but very poor customer service",
        "Date": "2022-09-20",
        "Heading": "Balenciaga gave me a damage bag then I…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Vika M",
        "Body": "Will never buy from this evil company. Dont pretend you didnt know what you have done.. But the only thing i love seeing, what there are so many TRUE and SINCERE people, who understands what the f..k is happening. The truth and goodness wins.",
        "Date": "2022-11-28",
        "Heading": "Will never buy from this evil company",
        "Location": "LT",
        "Rating": 1
    },
    {
        "Author": "Biker",
        "Body": "Pedophile company. Child sexual exploitation in their marketing images. Disgusting people. Diagusting customers still supporting these abusers",
        "Date": "2023-01-02",
        "Heading": "Pedophile company",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Aidaros Ali",
        "Body": "You are a danger to all kids around the world you disgusting demons. The fact that you got ballsy enough to try and use your messed up deeds as a product to sell to the same people whos children you would probably taint is sickening. All of you genuinely deserve to be put out one by one",
        "Date": "2022-12-10",
        "Heading": "PUT THEM OUT ONE BY ONE",
        "Location": "SE",
        "Rating": 1
    },
    {
        "Author": "Yuci Ma",
        "Body": "Great company, great designs. Every piece of clothings are worth the price that’s being charged. However the customer service is horrible. You order something that is being expected to be delivered within 4 business days, but the processing took 3 days, and then the actual shipping will be taking another 7 days because UPS don’t deliver during weekends. Do yourself a favour always order from SSENSE they always deliver with the fastest option. Personally I’m not getting paid to write this, but when I lived in Montreal I ordered from SSENSE, I ordered with free shipping (done on Monday) delivered by Wednesday. Hence why if you live in Canada order from SSENSE is the best choice, and their customer support is 24/7 always helping you out. Unlike balenciaga’s official website which says their phone call starts 9am, but actually doesn’t. What’s worse is that the live chat is 60% unavailable. You’d literally catch brain tumours by ordering directly from balenciaga.",
        "Date": "2018-12-20",
        "Heading": "If you you live in Canada please do not order directly from bale exists",
        "Location": "CA",
        "Rating": 1
    },
    {
        "Author": "Joanna Mia Davis",
        "Body": "You filthy pedos. Good people are on to you. Go to hell where you came from! 🤬",
        "Date": "2022-11-28",
        "Heading": "You filthy pedos",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "James Hartzog",
        "Body": "Bought 2 pairs of track trainers, and item arrived it was very poor quality so I decided to return the item which I did using the label they provided. After taking two months and several calls they said they denied my return and refund since they did not receive the items, even thought they provided me the label they are refusing to give me a refund or replacement. A waste of time and effort, multiple calls and hours wasted on the phone trying to reason with the representative amounted to nothing but a loss of thousands of $.",
        "Date": "2022-10-04",
        "Heading": "terrible customer service",
        "Location": "CA",
        "Rating": 1
    },
    {
        "Author": "Callum",
        "Body": "Where's my refund Balenciaga?",
        "Date": "2021-08-27",
        "Heading": "Where's my refund Balenciaga?",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Manuela Matkovic",
        "Body": "Never ever going to enter the store!Absolute trash company promoting abuse.",
        "Date": "2022-11-30",
        "Heading": "Trash",
        "Location": "AE",
        "Rating": 1
    },
    {
        "Author": "Kunal",
        "Body": "I bought a shirt for my husband. The quality is so bad that after one wash the shirt actually tore. When I went back to the store they lied and said we will send to Paris for evaluation. It will take 3 weeks. After 4 weeks I contacted them and the staff said its your fault take it back we can’t do anything. After I questioned where was it sent for evaluation. They said it wasn’t send anywhere so they lied earlier. And being such a big brand the staff was so damn rude no one would listen. Ideally any good brand would replace it or give store credit. They didn’t even bother to at least get it fixed. I paid $1600 for a bad quality shirt. Any local brand quality is better than Balenciaga",
        "Date": "2023-06-01",
        "Heading": "I bought a shirt for my husband",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Hajar Maen",
        "Body": "Pedos. If you buy from them you are supporting pedophilia",
        "Date": "2022-12-26",
        "Heading": "Pedos",
        "Location": "TR",
        "Rating": 1
    },
    {
        "Author": "Bailam Hassan",
        "Body": "Best option to avoid this people i bought 2 pair of balenciaga trainers\n\nThey deliver my parcel to somewhere else \nI called they laughed at me for losing my parcel it was worth £1,470\nAnd still don’t want to do a refund or replacement.\nPlease please avoid they scamming everyone.",
        "Date": "2023-02-08",
        "Heading": "avoid please",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Jessica Anderson",
        "Body": "Absolutely evil company promoting sick things with children, got caught, and will not apologize!  These people are sick and anyone wearing this brand is endorsing disgusting behavior and child sex abuse.",
        "Date": "2022-11-23",
        "Heading": "Absolutely evil company promoting sick…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Philip Carmen",
        "Body": "terrible customer service and a long time to get through",
        "Date": "2022-10-18",
        "Heading": "terrible customer service",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Gabrielle",
        "Body": "Discrimination at its finest! I feel sooo ashamed and not worthy of purchasing a designer item from Balenciaga.\nApparently I'm not good enough to buy designer and they don't like my payment choice which was Capital One Credit Card,because I tried to make purchase I made sure I called Capital One and told them I was making a big purchase. They said I was in the clear and it was approved. But I got an email saying my purchase was canceled due to payment! Balenciaga customer service told me there payment system which is through a 3rd party system is very sensitive and they got a red flag sooo they canceled my order without any explanation as to why! On top of that now I have to wait 5 days so they can send capital one a receipt saying they cancelled imy order so my funds can be released  and I can then reorder NO THANKS I’ll pass",
        "Date": "2018-08-17",
        "Heading": "Discrimination at its finest",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "edwin connelly",
        "Body": "What makes this sick disgusting ad campaign ever more shameful.\nIs they are saying they have sacked the photographer to make out it's her fault.\nShe should have known better and used her better judgement to not participate in this.\nBut she would of only been following instructions from balenciaga.\nBut they are now saying she is solwy to blame.   That is a cowardly act from this company to not have the balls to admit they were wrong in using children as sexual objects to make a profit.",
        "Date": "2022-11-25",
        "Heading": "Bunch of cowards to blame someone else",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Pantea George",
        "Body": "Ordered a pair of trainers of £750 on 30/11 for Christmas and to this day UPS lost the parcel and they keep blaming each other over the parcel, yet i had no refund or my product delivered, its a total joke coming from a company with a big name like this",
        "Date": "2020-12-30",
        "Heading": "Worst shopping experience",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Anthony Schroder",
        "Body": "Customer service is some of the worst i’ve ever dealt with. Not only were they not helpful but extremely rude. Their products aren’t even quality and you’re paying hundreds if not thousands for one item. Not to mention their stuff is made in 3rd world countries.",
        "Date": "2019-11-19",
        "Heading": "They’re a joke!",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Friedrich Roth",
        "Body": "Amazing brand, beautiful designs for my girls",
        "Date": "2021-03-16",
        "Heading": "Amazing brand",
        "Location": "DE",
        "Rating": 5
    },
    {
        "Author": "Jeremy Reschke",
        "Body": "Absolutely disgusting, tone deaf perverts.",
        "Date": "2022-11-25",
        "Heading": "Absolutely disgusting",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Robin A",
        "Body": "I have 3 balenciaga bags, one of which I bought on eBay years ago. The little leather ties on the zipper broke and I wanted to buy replacements. They didn’t have to match - just grey. Customer service was ridiculous. They requested a receipt, more pictures (I already sent some), and more information. It was a pretty simple request! I’ll never deal with the company again.",
        "Date": "2019-06-03",
        "Heading": "Awful Customer Service - No more Balenciaga for me!",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Camilla",
        "Body": "UPS lost my package and Balenciaga promised to fix this. Its now been 2 weeks with no answering from Balenciaga, they just shut the conversation down. UPS still dont know where the package is and no one is helping out. Please use other online shops instead of buying directly from balenciaga.com - they are just terrible at customs service. Also, avoid online stores",
        "Date": "2022-01-17",
        "Heading": "Do not order online, its a nightmare!",
        "Location": "NO",
        "Rating": 1
    },
    {
        "Author": "Tekela Brown",
        "Body": "The fact that y’all stole a clothing line that was not yours is down right unethical.  What happen to morals, and having dignity.  The Nologo brand is not yours  Balenciaga!!! How dare you take the name and put it on clothing .  The rightfully owners - Turquoise Love-Brown & Kennedy Brown  trademarked it!!! We will fight with them as they fight to have what rightfully belongs to them.  And y’all Nologo items look cheap and like trash! You really should be ashamed of stealing from small business owners! ",
        "Date": "2024-09-26",
        "Heading": "Stolen brand - Nologo apparel ",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Consumer",
        "Body": "Low quality super expensive . Don’t even honour  any warranty . If you buy a $1,500.00 shoes after 30 days you get no warranty. Their attitude is what you gonna do about it …",
        "Date": "2022-12-22",
        "Heading": "No warranty apply",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Diégo Freitez",
        "Body": "As much as i love balenciaga please go in store to properly check clothing pieces and understand its sizing, some of the new size proportions are ridiculous, nearly spent $1,400 on a jacket that fits me insanely huge at size S, Mind you I wear size M. I get the oversized look is trendy but sometimes it just simply looks hideous.",
        "Date": "2024-02-17",
        "Heading": "Great Brand but!!!",
        "Location": "US",
        "Rating": 3
    },
    {
        "Author": "KiD Trinity Official",
        "Body": "We will never support this company and or any other brand these sick fuqs create burn all ties with this company and watch it crumble to the floor and all the investors as well. We will not buy anything the investors create you are all rotten and will sit behind bars.",
        "Date": "2022-11-29",
        "Heading": "We will never support this company and…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Scotd",
        "Body": "Straight junk worst customer support ever!! oh and by the way apparently now they want to sexualize children to sell there crap.",
        "Date": "2022-11-23",
        "Heading": "Straight junk worst customer support…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "John",
        "Body": "made in china",
        "Date": "2020-01-22",
        "Heading": "made in china",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Ayten",
        "Body": "Zero service at clientservice.gbATbalenciaga.com for my quality issue! On my SNEAKER the \"A\"of the brand was lost :). Solution offered: ZERO. They told me to contact the shop, and the shop told me to contact the client services of Balenciaga. They ask a lot of money for their product which had bad quality. Do not pay for this bad quality and bad services! At Nike they just send a new pair......",
        "Date": "2024-04-13",
        "Heading": "Zero service at…",
        "Location": "NL",
        "Rating": 1
    },
    {
        "Author": "Harvey",
        "Body": "Balenciaga's contact page and all contact details seem to have been disabled, even their facebook page gives no contact at the moment. Not good if you need to contact them for any reason at all, as I do. So they would get no stars because their service does not currently exist.",
        "Date": "2018-07-18",
        "Heading": "Hello.... echo...",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Frank",
        "Body": "I’ve never seen a brand that makes people so mad that they will write an entire paragraph about it, and if those same people see you in public they will look away from you in anger and jealousy. I don’t think any of these people realize no one pays retail for any of this either unless you’re an absolute sucker which is even funnier. Balenciaga is very cool and fun, and there’s a reason everyone from H&M to Saint Laurent is copying their designs to try to get a piece of their success. This shit literally makes people question their status in life when you pull up with it and it’s absolutely hilarious because in the end it’s literally just some clothes. Cotton and mesh with a logo. And people get so bent out of shape about it immediately and will go out of their way to cope about how being able to afford it is stupid and how the clothes are a rip off. Demna lives rent free in the minds of many. Definitely consider a piece from this brand one day.",
        "Date": "2025-04-13",
        "Heading": "I’ve never seen a brand that makes…",
        "Location": "US",
        "Rating": 5
    },
    {
        "Author": "Jaxson ",
        "Body": "Bought balenciaga speeds easy",
        "Date": "2020-01-05",
        "Heading": "Bought balenciaga speeds easy",
        "Location": "GB",
        "Rating": 5
    },
    {
        "Author": "Pablo Garcia",
        "Body": "Over priced and gross offensive  ads.",
        "Date": "2022-12-08",
        "Heading": "Over priced and gross offensive  ads.",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Ruairí Morrissey",
        "Body": "Absolutely disgusting company of satanic pedophiles sexualising children",
        "Date": "2022-11-27",
        "Heading": "Absolutely disgusting company of…",
        "Location": "IE",
        "Rating": 1
    },
    {
        "Author": "Radu",
        "Body": "Keep kids away from weird adverts.",
        "Date": "2023-08-12",
        "Heading": "Keep kids away from weird adverts.",
        "Location": "RO",
        "Rating": 1
    },
    {
        "Author": "Jay",
        "Body": "Ye was right all along! A business run by elites pushing pedophilia into mainstream 🤮",
        "Date": "2022-11-25",
        "Heading": "Ye was right all along",
        "Location": "NZ",
        "Rating": 1
    },
    {
        "Author": "Nadjiah",
        "Body": "The worst ever they won’t deliver my stuff",
        "Date": "2018-12-18",
        "Heading": "The worst ever they won’t deliver my…",
        "Location": "NL",
        "Rating": 1
    },
    {
        "Author": "Heben Kennedy",
        "Body": "Pedos ! Buyer beware.",
        "Date": "2022-12-12",
        "Heading": "Pedos",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Lauren",
        "Body": "I was extremely apprehensive about ordering direct from the website due to the number of negative reviews on here, however decided to go for it. Ordered on 24/03/2021 shoes arrived 26/03/2021, extremely speedy service despite the website saying to expect delays due to brexit (I’m in Scotland). Unfortunately the shoes were too small, I accidentally ordered 2 sizes down from my usual size instead of the recommended 1 size down. Again, I was apprehensive about returning. Organising the return through the Balenciaga website was extremely easy, the difficult part was navigating the DHL website. After some time I figured out I had to use the Waybill number from the prepaid returns label to organise my pick up on the DHL Express website. I started the return process on 31/03/2021 - DHL collected my shoes the same afternoon and the next day (today 01/04/2021) my refund has been received by Balenciaga and is in process at the bank - really pleased with the whole service and would definitely order direct from the website again!",
        "Date": "2021-04-01",
        "Heading": "Please read if your nervous about ordering direct from the website based on bad reviews!!!",
        "Location": "GB",
        "Rating": 5
    },
    {
        "Author": "M",
        "Body": "I ordered the triple s sneakers on Tuesday the 22/10 as of 25/10 they hadn’t been shipped out. Until today when I complained. Also the fact that it states express post is a joke. If it were express I would have it by now. Coming from a high end fashion label this is just ridiculous. I need these shoes to arrive no later than 28/10. I found out today that I will be receiving them on the 29/10, hrs later it’s pushed even further 30/10 which by then I won’t be in the state to receive them or wear them. So I have just basically thrown $1245 in the bin and no shoes to wear to an event. Every label I have ever purchased from sends the item right away and I received it within 3-4 days. Thank you Belanciaga for being now my most hated label. I’ll be sure to spread the word of hate. DISGUSTING CUSTOMER SERVICE, DISGUSTING POSTAGE SERVICE, DISGUSTING WAY OF RUNNING A MULTI MILLION DOLLAR HIGH END LABEL.",
        "Date": "2019-10-25",
        "Heading": "Never again",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Bushra Zubair",
        "Body": "Bought shoes in May 2019, rang up in June 2019 literally a month later for a repair the sole was coming apart from the side and not even the bottom after wearing a couple of times, spoke to literally 10 agents, Curtis, Maria, Meghan who are incompetent of doing there job, I mean the worst is philip and Curtis the snobby guys who can’t even string a sentence together, and would cut the phone off and when you ring back they say there couldn’t hear anything.\nPhilip must be a new starter because he can’t even pronounce balenciaga, or answer the phones, think he came out of training a bit too early, customer service role isn’t for him, think he needs to go back to the warehouse for packing.\nThey were also they were adamant that it is wear and tear but couldn’t even define wear and tear they said they have no definition, until the director of sales got involved Greg the gentleman he resolved this within the hour, offered a full refund and they will most definitely be receiving them shoes back shortly. Absolutely vile company to buy from, never will I be shopping there again, considering I own a couple more shoes from balenciaga. Only just resolved this in August, fingers crossed when they receive the shoes they straight forward put the refund back in my account. Trading standards already involved, and complaint has been made.",
        "Date": "2019-08-08",
        "Heading": "The worst customer service employee award goes to Philip!",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Christian",
        "Body": "First place ugly shoes in the world",
        "Date": "2020-02-27",
        "Heading": "First place ugly shoes in the world",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Mini",
        "Body": "So I have 2 pairs one lace up and one full knit, the full knit ones i have worn a handy full of times and they have gone all bobley this is the reply ( how can you miss use a pair of shoes when they have hardly been worn)\n\npictures provided and we regret to inform you that the pointed out issue (bubbled fabric) is considered as caused due to improper use and unfortunately shoes cannot be repaired. Please note material is quite deformed, fabric has lots of peeling and is quite consume, shoes shoe several signs of misuse'.\nLoad of rubbish not good customer service not good shoes for the amount of money paid it's discusting \n\nHow can they say that without asking for the shoes back, if they looked at the soles you can see they haven't been worn much at all. Not happy ",
        "Date": "2025-02-10",
        "Heading": "Very poor full knit shoes ",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Mrs Marie Tona",
        "Body": "Absolutely shocking, they use DHL to do their deliveries, DHL delivered to a wrong address, balenciaga are still waiting on DHL to give them information about the trainer, they are refusing to give a refund, nearly 3 weeks later, I’m out of pocket of £735 absolute disgusting and DHL have broken GDPR by giving out my information. ",
        "Date": "2024-04-07",
        "Heading": "Absolutely shocking",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Zyzz bruh",
        "Body": "Oh sorry we didn’t realise what we were doing it was someone else’s fault 🤣🤣 stupid rats trying to deny the fact the table was  filled with copies of a 2008 Supreme Court ruling related to child pornography. Filthy maggots",
        "Date": "2022-12-12",
        "Heading": "Oh sorry we didn’t realise what we were…",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Trenton Buckingham",
        "Body": "A horrible, disgusting company that promotes the sexualization of children. They are not sorry for their new ads but they are sorry because they got caught. People need to stand up against companies like this.",
        "Date": "2022-11-29",
        "Heading": "Groomers",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "ACAB",
        "Body": "I’m not a customer, I’m just a smart observer. I simply want to point out how ugly and ridiculous this brand is. That’s all.\n\nWishing you a good day, and congratulations on convincing some unfortunate people to buy your products.\n\nSincerely,\nClaudio Conti",
        "Date": "2025-01-26",
        "Heading": "I’m not a customer",
        "Location": "IT",
        "Rating": 1
    },
    {
        "Author": "Halata Meckarov",
        "Body": "Sick pedophiles should be criminally prosecuted.",
        "Date": "2022-11-29",
        "Heading": "Sick pedophiles should be criminally…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "P. Istoff",
        "Body": "You are a bunch of disgusting paedophiles. I hope you rot in hell. You obviously have no idea what it feels like and the lifelong struggles it causes. Here's to your business imploding.",
        "Date": "2022-12-02",
        "Heading": "You are a bunch of disgusting…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Jessica P",
        "Body": "CANCEL BALENCIAGA!!! A bunch of pedophiles and most likely involved in child trafficking CANCEL CANCEL CANCEL DONT EVER BUY FROM THEM!!!",
        "Date": "2022-11-28",
        "Heading": "CANCEL BALENCIAGA!!",
        "Location": "NZ",
        "Rating": 1
    },
    {
        "Author": "Wayne ",
        "Body": "How in earth can anybody buy from this vile demonic pedophilia company \nUsing innocent young children in bondage and wrapped in tape \nThis disgusting company wants bankrupting \n\nAnd adidas teaming up with them are just as vile",
        "Date": "2023-10-19",
        "Heading": "How in earth can anybody buy from this…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Sta",
        "Body": "We as a society should never ever support a brand like this",
        "Date": "2022-11-27",
        "Heading": "We as a society should never ever…",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Steven Carter",
        "Body": "Promote child pornograhy. You bunch of sickos. Hope your company goes broke. But hey all of Hollywood support u because they are all pedos themselves",
        "Date": "2022-11-25",
        "Heading": "Promote child pornograhy",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Fox Tammy",
        "Body": "I bought a pair of Balenciaga  shoes at saks before the pandemic, wore them about 5 x, the metal stud fell off. I took the shoes to balenciaga at Bal Harbor to see if they could locate a stud to replace the one that fell off and got lost. The manager made 0 effort to help me! I own at least 6 bags- will never buy one again! I got the shoes fixed from a shoe repair co. But Balenciaga doesn’t stand by their goods.",
        "Date": "2021-10-20",
        "Heading": "I bought a pair of Balenciaga  shoes at…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "maddy whitcomb",
        "Body": "Paedophile company exploiting kids is vile and I hope that everyone with a brain and morals cuts there crap up",
        "Date": "2022-11-24",
        "Heading": "Paedophile company exploiting kids is…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Alin Diac",
        "Body": "Worst experience ever. I buy a pair of shoes for my wife £565 gift for her birthday. I couldn’t ask for express delivery because was blocked that option. After waiting and get the delivery second day after birthday they come different colour. One shoes was black and the other one like a dark blue(washed black) I call them and sent may emails and the only option they can offer to me is send the shoes back and wait 3 week for refund or place new order and pay twice till the refund  coming back. I ask to speak with a manager over the phone and they completely disagreed to pass me over. All the time when I’m calling is the same person answering or if someone else they transfer the call to the same person. Is the worst company ever seen.Never expect this expensive and when I seen everyone reviews here more disappointed because I didn’t check reviews before and never buy this rubbish company BALENCIAGA (BALEGA IN ROMANIA MEANS COW EXCREMENT AS THEY SINCERELY ARE)",
        "Date": "2020-06-02",
        "Heading": "Never, ever buy Balenciaga",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Jake Hoole",
        "Body": "Pedofile dogs hope you all burn in hell",
        "Date": "2022-11-27",
        "Heading": "Pedofile dogs hope you all burn in hell",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Morgan",
        "Body": "Balenciaga sock trainer only had 3 weeks and already the logo on the side is peeling off",
        "Date": "2021-12-09",
        "Heading": "Balenciaga sock trainer only had 3…",
        "Location": "GB",
        "Rating": 2
    },
    {
        "Author": "Mel Tel",
        "Body": "Dont support this brand",
        "Date": "2022-12-04",
        "Heading": "Dont support this brand",
        "Location": "CA",
        "Rating": 1
    },
    {
        "Author": "Renee Nemra",
        "Body": "Purchased a face mask from the Sydney store only to have the logo fade after a few weeks. I have emailed their customer service support twice and still no response. Not worth the $$$ or hassle to contact them and to be honest their quality absolutely does not reflect the price tag. Disappointed and disgruntled won’t be purchasing from this brand again.",
        "Date": "2021-10-04",
        "Heading": "Purchased a face mask from the Sydney…",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Shantae Richard ",
        "Body": "I placed a order 2304Z210120385 with this company on 4/23. In May I reached out and was told there warehouse was closed due to covid and once opened orders will ship as they were received. I initially want the order for my birthday however there was no chance I’d get them but I still liked them so I left the order. On June 5th I reached a return form from Balenciaga and I called to find out why because I never requested return nor received the item. I searched for emails from Balenciaga and saw there was an email in spam dated June 2 from a rep of their company named olivia that stated my order was delivered to the incorrect address and she was trying to get it to me. The rep that I currently had on the line had no knowledge of the situation and advised I would have to try back when Olivia was there. Which I did and also sent 3 emails before calling again to be told that she had spoken to her supervisor and that since it was after hours she called him at home and I was told he would be in the next day to issue a refund because they had no way to send a replacement and I would then have to place the order again. So today that’s what I was expecting to take place this morning. Now this evening I get an email that says it was delivered and they couldn’t help me. Never mind the fact they emailed me my order was some where else. If nothing else they could have provided the persons info so I can get my order myself since they can’t seem to. I just find it weird I was told one thing yesterday by phone only to be mailed sorry we can’t help you it was delivered. I will never order here again",
        "Date": "2020-06-11",
        "Heading": "I placed a order 2304Z210120385 with…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Jay P",
        "Body": "I was a little nervous when I had an issue with my speed trainers which were bought for me as a present - after reading the reviews, however Curtis and Valentina (customer services) assisted me and I was able to make my return and receive a full refund. The returns process takes some time however I am happy with my dealings with them.",
        "Date": "2019-10-22",
        "Heading": "Good service, product was not great",
        "Location": "GB",
        "Rating": 4
    },
    {
        "Author": "Will Bridge",
        "Body": "Shoes fell apart. \n\nEw. \n\nHorrible company.",
        "Date": "2023-07-26",
        "Heading": "Shoes fell apart",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Chloe Simmons",
        "Body": "Paid 665£ for a pair of trainers (with 1-3 day delivery) did not receive them, investigation has now been started to look into the lost item, which can take 14 working days. With no goods and refusal of refund whilst investigation ongoing, this is a joke. Had I looked at the reviews on here previously I would not of ordered with this company. It is not my fault the package has been lost and I expect a refund !",
        "Date": "2021-01-13",
        "Heading": "Lost trainers",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Duke Andrew Stevenson",
        "Body": "Sexualising children.",
        "Date": "2022-11-30",
        "Heading": "Sexualising children.",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Jez",
        "Body": "Absolutely horrific . Youve just exposed your satanic pedovore agenda",
        "Date": "2022-11-29",
        "Heading": "Absolutely horrific",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Lora Dorane",
        "Body": "Pathetic quality, ignorant kids best brand I assume.",
        "Date": "2021-04-07",
        "Heading": "Pathetic quality",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Nela",
        "Body": "Bought the pair. Within the first week of wearing them I noticed the letters were fading.. I have a picture to show. What a waste of 950 dollars. I wish I knew before I bough them. And if you are 12 hours on your feet, NOT worth it. Feet hurt at the end of day.",
        "Date": "2021-11-11",
        "Heading": "Bought the pair",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Kate ",
        "Body": "I can’t believe this brand is still going. Quality is so poor. I just wish there was an option to upload images of trainers fraying after one wear- seriously 1 hour of wear. £600 and clearly paying for the branding. Never had trainers of such poor quality. Used to love their leather goods but they are now selling to the label chasers rather than the quality that lasts. I mailed them about the fraying but no response. I’m annoyed with myself for expecting better quality",
        "Date": "2022-09-13",
        "Heading": "Poor and low grade product",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "lloyd simmons",
        "Body": "well after my trainers were lost by ups 6 hours on the phone 3 hours to Balenciaga and 3 hours to ups told they had found them after 2 weeks only to be told no lost again £750 trainers  staff rude was promised to call me back but never did  worst company \ni have ever  ever dealt with",
        "Date": "2020-12-19",
        "Heading": "well after my trainers were lost by ups…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Curtis QB",
        "Body": "Their customer service was really helpful. \nOrder was made easy",
        "Date": "2021-08-17",
        "Heading": "Their customer service was really…",
        "Location": "NL",
        "Rating": 5
    },
    {
        "Author": "Ahmed Khaldi",
        "Body": "Balenciaga promotes child pornography low life weird people",
        "Date": "2022-11-22",
        "Heading": "Balenciaga promotes child pornography…",
        "Location": "CZ",
        "Rating": 1
    },
    {
        "Author": "Ryan Y",
        "Body": "This company is untrustworthy, lies and overbearing. Went to buy a card waller and look at a bag, checked the price with the sales staff. On 2nd visit, asked for to look at the bag again, and checked the price with the sales staff and was shown the price tag inside the bag. As I was about to pay, she suddenly said the price has increased and insisted that we pay the new price! I refused as they had confirmed the price twice and shown me the price tag. The store manager couldn't bear the responsibility and needed to check with her office.\n\nThey refused to honour the original price despite telling the price verbally twice and showing the price tag. The sales staff didn't even apologize and was quite rude.\n\nWe advise everyone to avoid this brand and company. Their products are nothing special and even borrowing other brands (Adidas) to rip you off.",
        "Date": "2023-07-11",
        "Heading": "Untrustworthy, lies and rude.",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Paul",
        "Body": "This company will not even reply when there is an issue, my wife’s Xmas present was lost in transit and they just ignore my attempts to resolve it. They charge the earth for their goods but will not help.",
        "Date": "2022-01-28",
        "Heading": "This company will not even reply when…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Mr C",
        "Body": "Wow! Balenciaga and their Cust Svce should b beyond embaraased! The fact that $1200 Triple S kicks lining & heel tore, foam came out AND shoelace loops broke!! I was told to wear docks! And these shouldn’t b worn daily! And they are not responsible for wear & tear- Seriously?!! And I submitted images- BAD , AND I still wore them until last week when almost ALL MY LOOPS HAVE BROKEN AND CANNOT WEAR- what a waste!! AND ZERO remorse- Not even an apology- Nothing…",
        "Date": "2024-04-08",
        "Heading": "Worst Cust Svce EVER!!",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Lady Shenna",
        "Body": "This company is using young children for their malicious wicked campaign.",
        "Date": "2023-05-19",
        "Heading": "Wicked sick company",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Tati",
        "Body": "Also here NO goods received from the OFFICIAL website, Shoes for 895 €. Upon request, the proof of delivery contains an incomprehensible delivery address called the service area in a different city with a fake signature and information about the comparison with the ID suddenly says: the goods were sent to the DHL parcel station (?). \"By a person authorized by the signatory picked up. This person had the ID and a signed letter of approval with them, so your order is considered to have been delivered regularly.\" That drowned out and made a lie, a person was NEVER commissioned to collect it, let alone issued such a document! As a contractual partner of DHL, Balenciaga blocks the investigation and suppresses the wrong collection documents.",
        "Date": "2021-08-31",
        "Heading": "Hands off !!! This company shines with fraud !!!",
        "Location": "DE",
        "Rating": 1
    },
    {
        "Author": "Mitchel",
        "Body": "I’m still waiting for my refund! €625 euros. And they false promises to get back later on the day! Such a scam for a huge company. The costumer service is really bad and they don’t speak fluently English at all. I’m going to take legal actions against this company.",
        "Date": "2021-07-30",
        "Heading": "I’m still waiting for my refund!!!!",
        "Location": "NL",
        "Rating": 1
    },
    {
        "Author": "Shaggy the Great",
        "Body": "Well, you are vile and disgusting. Every single aspect of that ad was purposefully placed there and don't play stupid. You don't represent the values of ANY NORMAL HUMAN. I am really P'ed off. PS ...you are nothing more than dressed up overpriced Sketches. LOL....you suck",
        "Date": "2022-11-23",
        "Heading": "Surprised....but not REALLY.",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Carlos",
        "Body": "Putrid brand",
        "Date": "2022-11-25",
        "Heading": "Putrid brand",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "David Allan",
        "Body": "If you think this is costly, it's because you're too poor to buy them. Don't buy them if you don't like them or if you think they are not worth it, period!",
        "Date": "2022-03-01",
        "Heading": "If you think this is costly",
        "Location": "SE",
        "Rating": 5
    },
    {
        "Author": "Mayden",
        "Body": "I bought the Balenciaga Crush tote bag not long ago and after few months use, I found a rip in the bag whilst shopping in a department store. I have no idea how that rip occurred and had not come across any incidents. I was so heartbroken and disappointed. I reached out to Balenciaga but they said it was wear and tear?? How can a luxury bag be made of such poor quality? When you pay that much for a bag, you would expect the bag to handle day to day wear.",
        "Date": "2024-05-27",
        "Heading": "I bought the Balenciaga Crush tote bag…",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Vanessa Lumala",
        "Body": "They have the WORST CUSTOMER service known to the universe! \n\n\nThey advertise services they can not fulfil and Their team is full of incompetent individuals in addition it has taken over three weeks to receive a refund and still haven’t received it.\n\nThe WHOLE COMPANY IS A WASTE OF TIME AND THEY WILL NO LONGER BE GETTING MY COIN",
        "Date": "2018-07-13",
        "Heading": "They have the WORST CUSTOMER service…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Daniel",
        "Body": "I bought a pair of TripleS from Balenciaga Serravalle Outlet Milano on 12 of June 2022,  unfortunately the seam has come undone. \nI contact the store to repair or replace it and I'm still waiting for an answer … 2 months.\nI contact the head office customer service from Balenciaga - and the answer was rude , to contact the store where I bought it .\nI can't believe that such a big company doesn't take care of its customers",
        "Date": "2022-09-01",
        "Heading": "I bought a pair of TripleS from…",
        "Location": "IT",
        "Rating": 1
    },
    {
        "Author": "Ali",
        "Body": "Ordered 3 caps at the end of July, the parcel arrived and there were only 2 in the box although the invoice sheet reads 3 correctly. Customer service completely unhelpful and rude, spoken to in the most condescending way like it was somehow my fault. Apparently they have opened a case with UPS but not had an update in 3 weeks now. Told I have to wait and not use the items or dispose of the packaging in case UPS need it for their investigation, so completely out of pocket with missing item and items I cannot use.\n\nDon't bother, you'd think a high-end fashion house like this would have top-level customer support that is in line with their price point.",
        "Date": "2020-08-19",
        "Heading": "Items missing from order - shocking customer service",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Charlene Challita",
        "Body": "Disgusting and wrong\nShame on you",
        "Date": "2022-11-25",
        "Heading": "Disgusting and wrong",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Amanda Woollaston ",
        "Body": "If I could give them 0 I happily would\n\nBought a bag used it twice and it needed a repair. Took four weeks to respond to my email. Customer service was abrupt, unhelpful and lied. No replacement or refund and now I have to wait weeks for it to arrive assesses, repaired and returned. They could not care less and its about what is best for them and not the customer. So disrespectful and caused a great deal of stress and upset. The worst company EVER. ",
        "Date": "2024-12-23",
        "Heading": "If I could give them 0 I happily would",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Mark Vallas",
        "Body": "No sensible or ethically decent person would pay big $$$ to buy Balenciaga brand which openly promotes pedophilia. Takes a real sucker to pay $1000s for their crap sneakers, handbags, etc.  ",
        "Date": "2024-05-20",
        "Heading": "No sensible or ethically decent person…",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Ash Alahi",
        "Body": "Disgusting degenerate company!!!! Don't support this company at all.",
        "Date": "2022-11-25",
        "Heading": "Disgusting degenerate company!!!",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Olivia",
        "Body": "Balenciaga knew what they were doing when they decided they were going to put out ads sexualizing children. They were seeing how far they could go, how far they could push the envelope. It is completely abhorrent. DISGUSTING. Children must be PROTECTED. Balenciaga supports the corruption of children.\nI urge everyone who reads this, Don’t buy from them ever again!",
        "Date": "2022-11-24",
        "Heading": "Balenciaga endorses pedophilia.",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "MRSD",
        "Body": "Bought from their website so order was coming from Italy. I expected a slight delay due to Brexit. 6 weeks later still no parcel. \nI attempted communication via WhatsApp, chat, email, Instagram and telephone....long delays, sometimes no response, having to chase and chase. Took no ownership for the missing parcel. Directed me to UPS. who directed me back to Balenciaga! Awful customer service. No clear process, lacked accountability, no customer care! \nWill never again buy from them. Had to chase and chase for a refund!!!!!! Being told I had to wait for UPS to\nConclude their investigation which had made zero progress in 2 weeks and no date as to when to expect a conclusion! \nUPS and Balenciaga are the worst combination! Avoid! \nTerrible all round experience.",
        "Date": "2021-03-12",
        "Heading": "Customer care is non existent",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "PYildiz",
        "Body": "I purchased Classic City S handbag from Selfridges London in the beginning of January 2019. However, after 3-4 months, tassels were broken and separated in addition to wear on piping, which is not exposed to any friction. As I live in a different country I sent an email to Balenciaga and Selfridges with all relevant photos. But the store requested delivery of the handbag. I visited the Balenciaga at Selfridges at the end of October and showed the handbag. The staff took the photos to be sent to the technical staff. Although I asked why delivery of the handbag was requested 5 months ago despite the fact that photos were sufficient for inspection which I already submitted, I could not get any answer. I visited the store again 2 weeks later as I did not get any response where I saw that my complaint was not submitted to the technical department!!! Same procedures applied again; photos were taken, a report was arranged etc. In each communication, I requested exchange as that was obvious quality problem. Of course, this request was not accepted based on the justification that lampskin is delicate and this wear is normal!! I spent lots of time both for writing to Balenciaga and visiting Selfridges store to get an answer to my questions. Finally, in the beginning of December, I received an email from Selfridges stating the technical staff accepted to apply FREE repair. Although what I experience is obvious quality problem, Balenciaga is doing a favor as if the problem has arisen due to my mistake!! In order to stop this conversation, I accepted their offer on 5th of December 2019. It is 20th of January and repair process has not completed yet. I haven't seen such a terrible aftersale service before.",
        "Date": "2020-01-19",
        "Heading": "Poor aftersale service",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Chris Carey",
        "Body": "Would give zero stars if possible, anybody that does business with them after the pedophilia ads they put out is supporting that",
        "Date": "2022-11-25",
        "Heading": "Would give zero stars if possible",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Sue",
        "Body": "Worst flip-flops ever!!! Used em for 2 months and trasssshhhhh!!!! Never again,  would rather buy 20 flip flops at Walmart.     (They last longer) wish I could post a picture of them here.",
        "Date": "2022-08-29",
        "Heading": "Worst flip-flops ever!!",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Dee Pie",
        "Body": "Definitely not worth a star that’s for sure. Vile paedophilic company!\nWhat company in their right mind would allow/advertise children with bondage gear accessories? The only people who think like that are people who want to sexualise little children ( also known as dirty paedo’s ). I really do hope this company disappears soon, along with the owners of this disgusting \"business\".",
        "Date": "2022-11-30",
        "Heading": "PEDO COMPANY, Definitely not worth a star that’s for…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Delia Coria",
        "Body": "Worst experience . I bought a purse a while back and the strap was damaged. I took it back to get fix in January and is now May and is still not ready. No one even call me to update me,I had to called them. The “Manager” is saying it will take up to 1 year for them to approve the repair of something that I got damaged. Will never buy another item from them. Too pricy to wait a year for is defected purse. ",
        "Date": "2024-05-08",
        "Heading": "Worst experience ",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Affelstann",
        "Body": "Bad customer service and bad products, products are overpriced trash.",
        "Date": "2021-10-10",
        "Heading": "Bad customer service and bad products",
        "Location": "US",
        "Rating": 1
    },
    {
        "Author": "Thôrn von Raventorque",
        "Body": "Sick, perverted criminals",
        "Date": "2022-11-26",
        "Heading": "Criminals",
        "Location": "AU",
        "Rating": 1
    },
    {
        "Author": "Adam Hussain",
        "Body": "Terrible spent £600 on trainers which came in 15 days because of a misunderstanding not acceptable considering I spent that much on them delivery service is rubbish order off a different website",
        "Date": "2020-11-30",
        "Heading": "Terrible spent £600 on trainers which…",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Tasha",
        "Body": "I give them 3 stars cause the customer service does not quite match the quality of the product. Exchange took forever, but my shoes are the envy of everyone. If you improve the customer service you would get 5 stars",
        "Date": "2019-10-02",
        "Heading": "I give them 3 stars cause the customer…",
        "Location": "GB",
        "Rating": 3
    },
    {
        "Author": "Elena Dunn",
        "Body": "Balenciaga abuses little children featuring them in semi-pornographic adverts. Absolutely disgusting!",
        "Date": "2022-11-26",
        "Heading": "Balenciaga caters for paedophiles!",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Ελευθερία Παπαστεργίου",
        "Body": "You trying to \"sell us\" this sickness of pedophile like a normal thing? That's your purpose? You are evil and sick!!! LET THE CHILDREN OUT OF THIS!!! #CANCELBALENCIAGA\nYOU ARE MONSTERS!!! GO TO HELL OH I'M SORRY YOU ALREADY BELONG THERE!!!!",
        "Date": "2022-11-28",
        "Heading": "You trying to \"sell us\" this sickness…",
        "Location": "GR",
        "Rating": 1
    },
    {
        "Author": "Nat",
        "Body": "Order did not arrive.. was signed for by house share next door they then claimed not to have any knowledge of. Balenciaga refuse to acknowledge this leaving me 400 out of pocket.",
        "Date": "2020-06-11",
        "Heading": "Order did not arrive.",
        "Location": "GB",
        "Rating": 1
    },
    {
        "Author": "Mustafa",
        "Body": "copped the balenci gym wear shirts, crazy quality",
        "Date": "2020-07-21",
        "Heading": "copped the balenci gym wear shirts",
        "Location": "CA",
        "Rating": 5
    }
]